package com.scurto.shared;

import com.scurto.model.SiteModel;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashMap;
import java.util.Optional;
import java.util.stream.Stream;

public class SitesStorage {

    public static ArrayList<SiteModel> getAllSitesTaskModelArray() {
        return new ArrayList<SiteModel>(getAllSitesModel().values());
    }

    public static SiteModel getSiteModelById(String key) {
        return getAllSitesModel().get(key);
    }

    public static HashMap<String, SiteModel> getAllSitesModel() {
        HashMap<String, SiteModel> siteModels = new HashMap<>();
        siteModels.put("0", model(
                "0",
                10,
                10,
                "1",
                "1",
                null,
                "testTaskOwner",
                "http://detskie-recepty.ru",
                "1",
                createSecondaryUrls(
                        "www.mainUrl.com/aaa",
                        "www.mainUrl.com/bbb",
                        "www.mainUrl.com/ccc",
                        "www.mainUrl.com/ddd",
                        "www.mainUrl.com/eee",
                        "www.mainUrl.com/fff",
                        "www.mainUrl.com/ggg"
                )

        ));
        siteModels.put("1", model(
                "1",
                10,
                10,
                "3",
                "3",
                null,
                "testTaskOwner",
                "http://hodizdorov.ru/site-map",
                "4",
                null
        ));
        siteModels.put("1648314", model(
                "1648314",
                45,
                45,
                "0",
                "0",
                null,
                "10813496 - Genadi",
                "http://see-online.ru/",
                "6",
                null
        ));

        siteModels.put("1856449", model(
                "1856449",
                45,
                45,
                "1",
                "4",
                null,
                "10813496 - Genadi",
                "http://see-online.ru/",
                "6",
                createSecondaryUrls(
                        "http://see-online.ru/2018/02/23/простой-метод-пифагора-который-помож/",
                        "http://see-online.ru/2018/02/23/12-приложений-которые-заменят-психолог/",
                        "http://see-online.ru/2018/02/23/28-постов-в-соцсетях-ради-которых-стоит/",
                        "http://see-online.ru/2018/02/23/15-крутых-традиций-в-разных-странах-мира/",
                        "http://see-online.ru/2018/02/23/ганский-художник-рисует-отношения-та/",
                        "http://see-online.ru/2018/02/18/психологи-назвали-10-простых-истин-кото/",
                        "http://see-online.ru/2018/02/18/15-изобретений-которые-делают-наш-мир-о/",
                        "http://see-online.ru/2018/02/18/21-факт-о-нашем-мире-для-тех-кто-уже-давно/",
                        "http://see-online.ru/2018/02/18/15-забавных-тортов-которые-могли-бы-поу/",
                        "http://see-online.ru/2018/02/18/25-фото-на-которых-происходит-чуточку-б/",
                        "http://see-online.ru/2018/02/18/20-доказательств-что-аватаркам-в-соцсет/",
                        "http://see-online.ru/2018/02/18/эти-дизайнеры-шьют-наряды-примерить-к/",
                        "http://see-online.ru/2018/02/18/13-звезд-которые-когда-то-ночевали-на-ул/",
                        "http://see-online.ru/2018/02/18/фотограф-показала-что-красивые-снимк/",
                        "http://see-online.ru/2018/02/18/31-парных-тату-за-которыми-скрываются-и/",
                        "http://see-online.ru/2018/02/18/20-наглядных-сравнений-которые-заставя/",
                        "http://see-online.ru/2018/02/18/12-побочных-эффектов-тренировок-с-котор/",
                        "http://see-online.ru/2018/02/08/5-приемов-экстремального-вождения-зим/",
                        "http://see-online.ru/2018/02/08/11-иллюстраций-о-том-как-меняется-жизнь/"
                )
        ));

        siteModels.put("1656028", model(
                "1656028",
                45,
                45,
                "1",
                "4",
                null,
                "10813496 - Genadi",
                "http://news-post.ru",
                "9",
                null
        ));

        siteModels.put("1857640", model(
                "1857640",
                45,
                45,
                "1",
                "4",
                null,
                "10813496 - Genadi",
                "http://cofee-room.ru",
                "6",
                null
        ));


        siteModels.put("1764661", model(
                "1764661",
                45,
                45,
                "0",
                "0",
                null,
                "11206263 - Дмитрий",
                "http://loxik.ru/",
                "6",
                null
        ));
        siteModels.put("1829581", model(
                "1829581",
                45,
                45,
                "0",
                "0",
                null,
                "11206263 - Дмитрий",
                "http://mknik.ru",
                "6",
                null
        ));
        siteModels.put("1764648", model(
                "1764648",
                45,
                45,
                "0",
                "0",
                null,
                "11206263 - Дмитрий",
                "http://hancho.ru/",
                "6",
                null
        ));

        siteModels.put("1750464", model(
                "1750464",
                45,
                45,
                "0",
                "0",
                null,
                "11016161 - Stepan",
                "http://grvume.ru/",
                "6",
                null
        ));

        siteModels.put("1750467", model(
                "1750467",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://grvume.ru/",
                "8",
                null
        ));

        siteModels.put("1821705", model(
                "1821705",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://qanak.ru",
                "8",
                null
        ));

        siteModels.put("1812037", model(
                "1812037",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://havaei.ru/",
                "8",
                null
        ));

        siteModels.put("1737822", model(
                "1737822",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://mikik.ru/",
                "8",
                null
        ));

        siteModels.put("1850092", model(
                "1850092",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://axjik.ru",
                "8",
                null
        ));

        siteModels.put("1761182", model(
                "1761182",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://qani.ru",
                "8",
                null
        ));
        siteModels.put("1730504", model(
                "1730504",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://etedu.ru",
                "8",
                null
        ));
        siteModels.put("1711080", model(
                "1711080",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://ininik.ru",
                "8",
                null
        ));
        siteModels.put("1713348", model(
                "1713348",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://dezok.ru",
                "8",
                null
        ));
        siteModels.put("1730509", model(
                "1730509",
                45,
                45,
                "1",
                "4",
                null,
                "11016161 - Stepan",
                "http://gexecik.ru",
                "8",
                null
        ));
        siteModels.put("1794419", model(
                "1794419",
                30,
                30,
                "0",
                "0",
                null,
                "9950949 - Artyom",
                "https://mysnova.ru/",
                "6",
                null
        ));
        siteModels.put("1641652", model(
                "1641652",
                30,
                30,
                "0",
                "0",
                null,
                "9950949 - Artyom",
                "http://sunsang.ru/",
                "6",
                null
        ));
        siteModels.put("1751091", model(
                "1751091",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://virnag.ru/",
                "6",
                createSecondaryUrls(
                        "http://virnag.ru/2017/09/21/3-х-летняя-дочь-аллы-пугачевой-поразила/",
                        "http://virnag.ru/2017/09/21/при-обнаружении-заброшенной-хижины-у/",
                        "http://virnag.ru/2017/09/21/дженнифер-лопес-в-живом-платье-фант/",
                        "http://virnag.ru/2017/09/21/самая-обычная-девушка-с-зарплатой-про/",
                        "http://virnag.ru/2017/09/20/хорошей-хозяйкой-обязана-быть-даже-та/",
                        "http://virnag.ru/2017/09/24/найди-вора-и-познай-себя/",
                        "http://virnag.ru/2017/09/23/психологический-любовный-тест/",
                        "http://virnag.ru/2017/09/23/григорий-лепс-показал-свою-жену-тепер/",
                        "http://virnag.ru/2017/09/23/сода-которая-сэкономит-вам-кучу-денег/",
                        "http://virnag.ru/2017/09/23/женщина-впустила-бездомного-переноч/",
                        "http://virnag.ru/2017/09/23/увлекательный-тест-на-определение-ти/",
                        "http://virnag.ru/2017/09/22/непризнанное-чудо-света-отель-набрав/",
                        "http://virnag.ru/2017/09/22/каким-является-дом-твоей-мечты-выбери/",
                        "http://virnag.ru/2017/09/22/вы-знаете-как-добывают-мускус-для-парф/",
                        "http://virnag.ru/2017/09/22/не-покупайте-лосось-в-ближайший-месяц/",
                        "http://virnag.ru/2017/09/22/внимание-новый-вирус-вымогает-фото-по/",
                        "http://virnag.ru/2017/09/21/5-ужасных-трагедий-в-аквапарке/",
                        "http://virnag.ru/2017/09/21/бабушка-в-мини-это-слишком-дерзки/",
                        "http://virnag.ru/2017/09/21/невероятно-то-какую-прическу-ты-любиш/",
                        "http://virnag.ru/2017/09/21/этот-необычный-диван-3-в-1-поразил-всех-п/"
                )
        ));
        siteModels.put("1806770", model(
                "1806770",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://veekn.ru/",
                "6",
                createSecondaryUrls(
                        "http://veekn.ru/2018/03/04/берлинская-телебашня/",
                        "http://veekn.ru/2018/03/04/дождевые-леса/",
                        "http://veekn.ru/2018/03/04/13-идиотских-причин-которые-будут-препя/",
                        "http://veekn.ru/2018/03/04/что-делает-женщину-желанной-мнение-му/",
                        "http://veekn.ru/2018/03/04/7-причин-по-которым-пожилые-мужчины-ста/",
                        "http://veekn.ru/2018/03/04/остров-маккуори/",
                        "http://veekn.ru/2018/03/04/национальный-парк-ламингтон/",
                        "http://veekn.ru/2018/03/04/сексуальная-совместимость-знаков-зо/",
                        "http://veekn.ru/2018/03/04/парк-улуру-ката-тьюта/",
                        "http://veekn.ru/2018/03/04/11-заповедей-ширди-саи-бабы-которые-сде/",
                        "http://veekn.ru/2018/03/04/это-невероятно-женщины-могут-достичь/",
                        "http://veekn.ru/2018/03/04/22-года-назад-мужчина-серьезно-ранил-сво/",
                        "http://veekn.ru/2018/03/04/национальный-парк-йенго/",
                        "http://veekn.ru/2018/03/04/10-заповедей-идеальной-жены-которая-поч/",
                        "http://veekn.ru/2018/03/04/радолл-ривер/",
                        "http://veekn.ru/2018/03/04/базилика-сант-амброджо/",
                        "http://veekn.ru/2018/03/04/чудо-тибета/"
                )
        ));
        siteModels.put("1821964", model(
                "1821964",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://wgoogle.ru/",
                "6",
                createSecondaryUrls(

                        "http://wgoogle.ru/2018/02/23/5-низкокалорийных-салатов-которые-нас/",
                        "http://wgoogle.ru/2018/02/23/как-ухаживать-за-геранью-чтобы-она-выг/",
                        "http://wgoogle.ru/2018/02/23/новый-тренд-в-окрашивании-волос-сочны/",
                        "http://wgoogle.ru/2018/02/22/6-причин-тёмных-кругов-под-глазами-не-с/",
                        "http://wgoogle.ru/2018/02/22/5-причин-почему-не-стоит-удалять-волосы/",
                        "http://wgoogle.ru/2018/02/22/105-лет-спустя-эксклюзивные-кадры-с-мест/",
                        "http://wgoogle.ru/2018/02/21/врачи-рассказали-в-каком-возрасте-нач/",
                        "http://wgoogle.ru/2018/02/21/названы-возможные-причины-по-которым/",
                        "http://wgoogle.ru/2018/02/20/рецепт-пышных-как-пух-оладий-которые/",
                        "http://wgoogle.ru/2018/03/01/как-выбрать-здоровую-орхидею-в-магази/",
                        "http://wgoogle.ru/2018/03/01/важная-причина-по-которой-женщинам-ну/",
                        "http://wgoogle.ru/2018/02/27/10-восхитительных-фильмов-в-стиле-ретро/",
                        "http://wgoogle.ru/2018/02/25/как-за-5-минут-починить-сломанный-ногот/",
                        "http://wgoogle.ru/2018/02/25/хочу-быть-в-тренде-7-модных-вещей-без-ко/",
                        "http://wgoogle.ru/2018/02/25/как-заботиться-о-долларовом-дереве-2/",
                        "http://wgoogle.ru/2018/02/25/новый-клип-кристины-орбакайте-вызвал/",
                        "http://wgoogle.ru/2018/02/24/фотограф-побывал-в-уникальном-монгол/",
                        "http://wgoogle.ru/2018/02/24/12-зодиакальных-пар-которые-лучше-всего/",
                        "http://wgoogle.ru/2018/02/24/7-продуктов-питания-которые-снижают-ри/",
                        "http://wgoogle.ru/2018/02/23/как-заботиться-о-долларовом-дереве/",
                        "http://wgoogle.ru/2018/02/23/первые-симптомы-язвы-желудка-которые/"
                )
        ));
        siteModels.put("1641863", model(
                "1641863",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://sunsang.ru/",
                "6",
                createSecondaryUrls(
                        "http://sunsang.ru/нут-отличный-источник-витаминов-и-мин/",
                        "http://sunsang.ru/причины-которые-вызывают-мигрень-и-3-пр/",
                        "http://sunsang.ru/5-мощных-рецептов-для-лечения-геморроя/",
                        "http://sunsang.ru/добавьте-в-шампунь-эти-3-ингредиента-и/",
                        "http://sunsang.ru/прочитайте-это-и-вы-начнете-есть-огуре/",
                        "http://sunsang.ru/9-продуктов-из-за-которых-у-нашего-тела/",
                        "http://sunsang.ru/глубокие-и-проникновенные-цитаты-рем/",
                        "http://sunsang.ru/говорят-какие-туфли-такая-и-жизнь/",
                        "http://sunsang.ru/диетическое-куриное-филе-в-сметане-с-л/",
                        "http://sunsang.ru/это-самая-эффективная-диета-за-послед/",
                        "http://sunsang.ru/всего-один-вопрос-который-сразу-улучш/",
                        "http://sunsang.ru/прежде-чем-ты-снова-отдашь-кому-то-свое/",
                        "http://sunsang.ru/у-меня-до-сих-пор-мурашки-каждый-раз-ка/",
                        "http://sunsang.ru/чеснок-убивает-14-видов-рака-и-13-видов-инф/",
                        "http://sunsang.ru/лечение-головной-боли-солью/",
                        "http://sunsang.ru/10-советов-от-разведенной-женщины-тем-к/",
                        "http://sunsang.ru/поставьте-стакан-воды-с-солью-в-доме-и/",
                        "http://sunsang.ru/две-токсичные-мысли-которые-портят-на/",
                        "http://sunsang.ru/всего-4-стакана-воды-после-сна-японск/",
                        "http://sunsang.ru/билл-мюррей-на-концерт-кантри-группы-the-stee/"
                )
        ));
        siteModels.put("1655548", model(
                "1655548",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://googs.ru/",
                "6",
                createSecondaryUrls(
                        "http://googs.ru/девочки-и-инстаграм/",
                        "http://googs.ru/вот-какого-мужчину-ты-должна-ждать/",
                        "http://googs.ru/16-раз-когда-″симпсонам″-удалось-сдела/",
                        "http://googs.ru/ленивый-наполеон-который-готовитс/",
                        "http://googs.ru/24-стильных-фото-новинок-цветного-франц/",
                        "http://googs.ru/из-за-налоговой-ошибки-пара-купила-ули/",
                        "http://googs.ru/16-фотографий-родителей-на-которых-они/",
                        "http://googs.ru/3-причины-из-за-которых-в-голове-крутит/",
                        "http://googs.ru/мужик-покупает-билет-на-жд-вокзале/",
                        "http://googs.ru/последний-анекдот-никулина-шутка/",
                        "http://googs.ru/новое-увлечение-посетители-музеев-ищ/",
                        "http://googs.ru/одесский-взгляд-на-деньги/",
                        "http://googs.ru/муж-взял-жене-и-любовнице-путевки-на/",
                        "http://googs.ru/бизнесмен-пытался-раздавать-хлеб-нуж/",
                        "http://googs.ru/самый-юридический-анекдот-года/",
                        "http://googs.ru/поклонники-пришли-в-ужас-от-нового-обр/",
                        "http://googs.ru/россиянина-обвинили-в-издевательств/",
                        "http://googs.ru/6-хитростей-из-школьной-программы-о-кот/",
                        "http://googs.ru/5-детей-хакеров-в-существование-которы/",
                        "http://googs.ru/худший-секс-круиз-в-истории-как-сифили/"
                )
        ));

        siteModels.put("1729018", model(
                "1729018",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://laflux.ru",
                "6",
                null
        ));

        siteModels.put("1820267", model(
                "1820267",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://izikam.ru/",
                "6",
                createSecondaryUrls(
                        "http://izikam.ru/2018/05/фатальная-ошибка-улрайхы-и-победа-реа/",
                        "http://izikam.ru/2018/05/вооруженные-силы-арцах-управляют-сит/",
                        "http://izikam.ru/2018/04/алиев-беспокоен-есть-большой-страх-пе/",
                        "http://izikam.ru/2018/04/эстонское-правительство-приняло-реш/",
                        "http://izikam.ru/2018/04/рафаэль-надаль-в-полуфинале/",
                        "http://izikam.ru/2018/05/барселона-избила-иньесту-последняя-и/",
                        "http://izikam.ru/2018/05/женщина-в-саудовской-арабии/",
                        "http://izikam.ru/2018/05/давид-хэчатрьян-проиграл-ирландском/",
                        "http://izikam.ru/2018/05/известно-кто-заменит-венгера/",
                        "http://izikam.ru/2018/05/уверенный-министр-здравоохранения/",
                        "http://izikam.ru/2018/05/территориальная-целостность-азерба/",
                        "http://izikam.ru/2018/05/75-летний-мэр-салоников-был-избит-в-грец/",
                        "http://izikam.ru/2018/05/полярная-богиня-шер-празднует-72-года/",
                        "http://izikam.ru/2018/05/бейонсе-купила-церковь-для-нее/",
                        "http://izikam.ru/2018/05/фигуристка-евгения-медведева-может-д/",
                        "http://izikam.ru/2018/05/трансфер-в-ювентус-был-лучшим-решение/",
                        "http://izikam.ru/2018/05/я-очень-расстроен-и-разбит/",
                        "http://izikam.ru/2018/05/мел-гибсон-собирается-снять-военную-д/",
                        "http://izikam.ru/2018/05/84-человека-были-арестованы-в-стамбуле-в/",
                        "http://izikam.ru/2018/05/руководитель-whatsapp-отказывается-от-должн/"
                )
        ));

        siteModels.put("1760244", model(
                "1760244",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "https://my-posts.ru",
                "6",
                null
        ));

        siteModels.put("1750962", model(
                "1750962",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://nagita.ru/",
                "6",
                createSecondaryUrls(

                        "http://nagita.ru/2017/11/16/одинокие-женщины-становятся-самыми-с/",
                        "http://nagita.ru/2017/11/16/10-простых-способов-очищения-лимфатиче/",
                        "http://nagita.ru/2017/11/16/вот-почему-нельзя-покупать-газировку/",
                        "http://nagita.ru/2017/11/16/мед-для-умывания-лица/",
                        "http://nagita.ru/2017/11/03/12-заключенных-сбежали-из-тюрьмы-в-алаба/",
                        "http://nagita.ru/2017/11/11/вадим-зеланд-чем-опасны-разговоры-о-зд/",
                        "http://nagita.ru/2017/11/16/узнайте-как-приготовить-этот-чесночн/",
                        "http://nagita.ru/2017/11/16/первые-признаки-инсульта-у-женщин-нуж/",
                        "http://nagita.ru/2017/10/21/старшая-дочь-меладзе-и-ее-супруг-сыгра/",
                        "http://nagita.ru/2017/11/16/а-вы-никогда-не-пробовали-положить-сли/",
                        "http://nagita.ru/2017/11/16/каждый-раз-когда-вы-теряете-надежду-по/",
                        "http://nagita.ru/2017/10/28/всем-бабушкам-посвящается-необыкнов/",
                        "http://nagita.ru/2017/09/16/что-желательно-иметь-в-доме/",
                        "http://nagita.ru/2017/11/16/смешайте-мед-и-аспирин-и-держите-на-лиц/",
                        "http://nagita.ru/2017/11/15/как-вылечить-больную-спину-мазью-из-ла/",
                        "http://nagita.ru/2017/09/18/закон-паркинсона-один-из-самых-важн/",
                        "http://nagita.ru/2017/11/15/жизнь-станет-проще-если-вы-поймётё-эти/",
                        "http://nagita.ru/2017/11/15/один-женский-навык-может-привлечь-в-тв/"
                )
        ));

        siteModels.put("1712033", model(
                "1712033",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://psixushka.ru/",
                "6",
                createSecondaryUrls(
                        "http://psixushka.ru/2018/02/22/евгений-плющенко-о-победе-украинки-ал-2/",
                        "http://psixushka.ru/2018/02/22/5-стран-которые-заплатят-вам-если-вы-бу-3/",
                        "http://psixushka.ru/2018/02/22/учёные-воссоздали-внешность-древнее/",
                        "http://psixushka.ru/2018/02/22/обычный-инженер-из-индии-завоёвывает/",
                        "http://psixushka.ru/2017/11/08/25-цитат-дейла-карнеги-за-которые-ему-мо/",
                        "http://psixushka.ru/2018/02/18/уникальные-кадры-с-затонувшего-тита/",
                        "http://psixushka.ru/2018/02/22/саркастичные-шуточки-по-поводу-дня-св/",
                        "http://psixushka.ru/2018/02/22/18-маленьких-деталей-в-известных-фильма/",
                        "http://psixushka.ru/2018/02/14/5-самых-подлых-знаков-зодиака/",
                        "http://psixushka.ru/2018/02/22/14-удивительных-кадров-которые-доказыв/",
                        "http://psixushka.ru/2018/02/21/5-стран-которые-заплатят-вам-если-вы-бу-2/",
                        "http://psixushka.ru/2017/11/10/пройдите-тест-и-узнайте-вашу-совмести/",
                        "http://psixushka.ru/2018/02/16/тюрьма-от-первого-лица-быт-зеков-котор/",
                        "http://psixushka.ru/2018/02/21/как-легко-помириться-с-мужчиной-учиты-4/",
                        "http://psixushka.ru/2018/02/21/какие-подарки-можно-принимать-а-какие/",
                        "http://psixushka.ru/2018/02/12/рейтинг-самых-добрых-знаков-зодиака-2/",
                        "http://psixushka.ru/2018/02/21/в-калифорнии-автомобиль-влетел-во-вто/",
                        "http://psixushka.ru/2018/02/21/самые-загрязненные-места-нашей-плане/"
                )
        ));

        siteModels.put("1712034", model(
                "1712034",
                30,
                30,
                "0",
                "0",
                null,
                "9950949 - Artyom",
                "http://psixushka.ru/",
                "6",
                null
        ));

        siteModels.put("1674967", model(
                "1674967",
                30,
                30,
                "0",
                "0",
                null,
                "9950949 - Artyom",
                "https://googs.ru/",
                "6",
                null
        ));
        siteModels.put("1794416", model(
                "1794416",
                40,
                40,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "https://mysnova.ru/",
                "5",
                null
        ));
        siteModels.put("1758715", model(
                "1758715",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://vikix.ru/",
                "5",
                createSecondaryUrls(
                        "http://vikix.ru/2017/11/03/от-чего-зависит-цвет-глаз/",
                        "http://vikix.ru/2017/11/03/завтрак-для-хорошего-настроения/",
                        "http://vikix.ru/2017/11/03/дочь-раскрывает-отцу-что-мать-ему-изме/",
                        "http://vikix.ru/2017/11/03/муж-любови-успенской-продал-бизнес-чт/",
                        "http://vikix.ru/2017/11/01/если-трехпалый-значит-инопланетянин/",
                        "http://vikix.ru/2017/11/01/необычное-разноцветное-озеро/",
                        "http://vikix.ru/2017/11/04/почему-я-перестала-гнаться-за-любовью/",
                        "http://vikix.ru/2017/11/04/мужчины-всегда-возвращаются/",
                        "http://vikix.ru/2017/11/04/михаил-лабковский-здоровый-человек/",
                        "http://vikix.ru/2017/11/04/5-лучших-рецептов-от-синдрома-хроничес/",
                        "http://vikix.ru/2017/11/04/10-фактов-о-пэрис-хилтон/",
                        "http://vikix.ru/2017/11/04/10-фактов-про-японию/",
                        "http://vikix.ru/2017/11/04/за-самые-дорогие-туфли-просят-15-миллион/",
                        "http://vikix.ru/2017/11/04/такса-по-кличке-денис-сбросила-20-кг/",
                        "http://vikix.ru/2017/11/04/в-канаде-прошел-чемпионат-по-заморажи/",
                        "http://vikix.ru/2017/11/03/принимаете-душ-каждый-день-а-вот-не-над/",
                        "http://vikix.ru/2017/11/03/быть-удобной-или-быть-счастливой/",
                        "http://vikix.ru/2017/11/03/7-секретов-кокетства-и-изящного-флирта/",
                        "http://vikix.ru/2017/11/03/уже-после-первого-применения-этого-ре/",
                        "http://vikix.ru/2017/11/03/почему-говорят-деньги-не-пахнут/",
                        "http://vikix.ru/2017/11/03/как-определить-характер-по-почерку/",
                        "http://vikix.ru/2017/11/03/канадец-стал-миллионером-дважды/",
                        "http://vikix.ru/2017/11/03/ким-кардашьян-и-канье-уэст-ждут-появле/",
                        "http://vikix.ru/2017/11/03/вот-это-толстячок-просто-неуёмная-эне/",
                        "http://vikix.ru/2017/11/03/папайя-и-яблочный-сок-для-очистки-толс/",
                        "http://vikix.ru/2017/11/03/vкопеечные-чудо-средства-для-красоты-к/"
                )
        ));

        siteModels.put("1820271", model(
                "1820271",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://kooka.ru",
                "5",
                createSecondaryUrls(

                        "http://kooka.ru/2018/06/22/тина-канделаки-работал-62-миллиона-рубл/",
                        "http://kooka.ru/2018/06/22/kонфликт-между-николом-пэшиняном-и-арм/",
                        "http://kooka.ru/2018/06/22/я-хотел-бы-работать-с-майклом-джексоно/",
                        "http://kooka.ru/2018/06/22/армянский-фестиваль-культуры-которы/",
                        "http://kooka.ru/2018/06/22/аргентинские-футболисты-хотят-вывес/",
                        "http://kooka.ru/2018/06/15/журналист-который-опубликовал-стать/",
                        "http://kooka.ru/2018/06/15/мне-нравятся-люди-как-алеп/",
                        "http://kooka.ru/2018/06/14/жерар-депардье-и-пьер-ришар-решили-сня/",
                        "http://kooka.ru/2018/06/14/была-арестована-супружеская-пара-кто/",
                        "http://kooka.ru/2018/06/14/в-его-день-рождения-трамп-возьмет-выхо/",
                        "http://kooka.ru/2018/06/14/iphone-защищион/",
                        "http://kooka.ru/2018/06/14/манчестер-юнайтед-еще-раз-стал-самым-д/",
                        "http://kooka.ru/2018/06/14/кремль-объявил-о-том-какие-иностранны/",
                        "http://kooka.ru/2018/06/14/темпы-обмена-валюты-с-14-июня/",
                        "http://kooka.ru/2018/06/14/дата-референдума-по-распределению-3-шт/",
                        "http://kooka.ru/2018/05/21/палестинский-президент-махмуд-аббас/",
                        "http://kooka.ru/2018/05/21/модель-formy-playboy-в-нью-йорке-с-7-летним-сыном-па/",
                        "http://kooka.ru/2018/05/21/памятник-маршала-бэгрэмьяна-открыва/"
                )
        ));

        siteModels.put("1806773", model(
                "1806773",
                45,
                45,
                "1",
                "4",
                null,
                "9950949 - Artyom",
                "http://yourhooby.ru/",
                "5",
                createSecondaryUrls(
                        "http://yourhooby.ru/2018/03/04/мать-закричала-на-сына-и-назвала-его-пр/",
                        "http://yourhooby.ru/2018/03/04/врачи-молчали-об-этом-секрете-узнайте/",
                        "http://yourhooby.ru/2018/03/04/эти-трюки-всего-за-6-дней-сделают-обвисш/",
                        "http://yourhooby.ru/2018/03/04/вот-как-один-и-тот-же-человек-будет-люби/",
                        "http://yourhooby.ru/2018/03/04/12-признаков-эмоционально-недоступных/",
                        "http://yourhooby.ru/2018/03/04/вы-пришли-в-класс-или-на-панелькак-нас/",
                        "http://yourhooby.ru/2018/03/04/лучшие-котировки-на-каждый-день/",
                        "http://yourhooby.ru/2018/03/04/осторожность-этот-парацетамол-содер/",
                        "http://yourhooby.ru/2018/03/04/если-ваше-сердце-разрушено-и-вы-ожидае/",
                        "http://yourhooby.ru/2018/03/04/это-ложь-что-человек-который-любит-вас/",
                        "http://yourhooby.ru/2018/03/04/правила-крепких-отношений/",
                        "http://yourhooby.ru/2018/03/04/эта-женщина-преодолела-4-ю-стадию-рака-б/",
                        "http://yourhooby.ru/2018/03/04/вот-такая-же-стрижка-которая-подходит/",
                        "http://yourhooby.ru/2018/03/04/вот-что-происходит-ночью-в-гробу-ленин/",
                        "http://yourhooby.ru/2018/03/04/симптомы-которые-женщина-не-может-игн/",
                        "http://yourhooby.ru/2018/03/04/мужчине-никогда-не-надоедает-женщина/",
                        "http://yourhooby.ru/2018/03/04/результаты-шокирующие-женщина-прост/",
                        "http://yourhooby.ru/2018/03/04/на-на-каком-пальце-женщина-носит-кольц-2/",
                        "http://yourhooby.ru/2018/03/04/прежде-чем-умереть-дэвид-боуи-раскрыл/",
                        "http://yourhooby.ru/2018/03/04/7-различия-между-женщинами-которых-муж/"
                )
        ));

        siteModels.put("1682975", model(
                "1682975",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://junjo.ru/",
                "5",
                null
        ));

        siteModels.put("1591609", model(
                "1591609",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "https://ooaoo.ru/",
                "5",
                createSecondaryUrls(

                        "https://ooaoo.ru/2017/10/14/малыша-бросили-в-холодный-подвал-в-раз/",
                        "https://ooaoo.ru/2017/10/14/позор-певицы-ирины-дубцовой-обозвав-з/",
                        "https://ooaoo.ru/2017/10/06/18-красавиц-показали-половину-своего-ли/",
                        "https://ooaoo.ru/2017/10/06/тест-вы-служанка-принцесса-или-короле/",
                        "https://ooaoo.ru/2017/10/06/иран-и-турция-отказались-от-доллара/",
                        "https://ooaoo.ru/2017/10/06/вот-полный-список-всех-секретных-кодо/",
                        "https://ooaoo.ru/2017/10/03/в-наса-признали-что-инопланетяне-суще/",
                        "https://ooaoo.ru/2017/10/03/осторожно-5-самых-отъявленных-стерв-по/",
                        "https://ooaoo.ru/2017/10/03/шеф-повар-знаменитого-ресторана-поде/",
                        "https://ooaoo.ru/2017/10/03/9-вещей-для-которых-женщина-за-30-уже-слиш/",
                        "https://ooaoo.ru/2017/10/02/развитие-ребенка-в-утробе-матери-19-сни/",
                        "https://ooaoo.ru/2017/10/02/люди-ожидали-услышать-от-девочки-песн/",
                        "https://ooaoo.ru/2017/10/02/на-9-м-месяце-беременности-ее-дочь-перес/",
                        "https://ooaoo.ru/2017/10/02/дмитрий-шепелев-о-втором-ребенке-хоче/",
                        "https://ooaoo.ru/2017/10/01/дочь-не-хочет-чтобы-мама-прикасалась-к/",
                        "https://ooaoo.ru/2017/10/01/оля-полякова-показала-мужа-бизнесмен/",
                        "https://ooaoo.ru/2017/10/01/5-эффективных-упражнений-для-подтянут/",
                        "https://ooaoo.ru/2017/10/01/самое-смешное-видео-в-мире-попробуй-не/",
                        "https://ooaoo.ru/2017/10/01/10-причин-есть-больше-сливочного-масла/",
                        "https://ooaoo.ru/2017/10/01/вы-больше-не-будете-выбрасывать-кожур/"
                )
        ));

        siteModels.put("1685680", model(
                "1685680",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://ukuki.ru",
                "5",
                null
        ));

        siteModels.put("897685", model(
                "897685",
                40,
                40,
                "1",
                "4",
                null,
                "6175130 - Phenix",
                "http://travki.in.ua/",
                "5",
                createSecondaryUrls(
                        "http://travki.in.ua/travy-a/5-air-obyknovenniy",
                        "http://travki.in.ua/travy-a/3-aloe-vera",
                        "http://travki.in.ua/travy-a/4-altei-lekarstvenniy",
                        "http://travki.in.ua/travy-a/6-astragal-povislocvetkoviy",
                        "http://travki.in.ua/travy-b/7-bagulnik-bolotniy",
                        "http://travki.in.ua/travy-b/10-bazilik-dushistiy",
                        "http://travki.in.ua/travy-b/11-barbaris-obiknovenniy",
                        "http://travki.in.ua/travy-b/8-bessmertnik-peschaniy-ili-cmin",
                        "http://travki.in.ua/travy-b/273-borovaya-matka-ortiliya",
                        "http://travki.in.ua/travy-b/9-boyarishnik",
                        "http://travki.in.ua/travy-b/21-brusnika",
                        "http://travki.in.ua/travy-b/13-buzina-travyanistaya",
                        "http://travki.in.ua/travy-v/12-valeriana-lekarstvennaya",
                        "http://travki.in.ua/travy-v/16-verbeinik-monetchatiy-ili-lugovoy-chay",
                        "http://travki.in.ua/travy-v/14-veresk-obiknovenniy",
                        "http://travki.in.ua/travy-v/15-veronika-lekarstvennaya",
                        "http://travki.in.ua/travy-v/20-vishnya-obiknovennaya",
                        "http://travki.in.ua/travy-v/17-volchec-kudryaviy"
                )
        ));

        siteModels.put("1684341", model(
                "1684341",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://jajan.ru/",
                "5",
                null
        ));

        siteModels.put("1679558", model(
                "1679558",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://ayaoyo.ru",
                "5",
                null
        ));

        siteModels.put("1612864", model(
                "1612864",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://erare.ru/",
                "5",
                null
        ));
        siteModels.put("1652702", model(
                "1652702",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://okoook.ru/",
                "5",
                null
        ));

        siteModels.put("1679577", model(
                "1679577",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://oookok.ru",
                "5",
                null
        ));

        siteModels.put("1752452", model(
                "1752452",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://timonik.ru/",
                "5",
                null
        ));
        siteModels.put("1681885", model(
                "1681885",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://elnelua.ru/",
                "5",
                null
        ));
        siteModels.put("1707416", model(
                "1707416",
                40,
                40,
                "1",
                "4",
                null,
                "10603708 - Areg",
                "http://chkaser.ru/",
                "5",
                null
        ));

        siteModels.put("1647364", model(
                "1647364",
                40,
                40,
                "0",
                "4",
                null,
                "10603708 - Areg",
                "https://ooaoo.ru/",
                "6",
                null
        ));

        siteModels.put("1667312", model(
                "1667312",
                40,
                40,
                "0",
                "4",
                null,
                "10603708 - Areg",
                "http://erare.ru/",
                "6",
                null
        ));

        siteModels.put("1622180", model(
                "1622180",
                40,
                40,
                "0",
                "4",
                null,
                "7017738 - Vedun",
                "http://fitfb.ru/",
                "6",
                null
        ));
        siteModels.put("1724783", model(
                "1724783",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://mindmo.ru/",
                "8",
                null
        ));

        siteModels.put("1579284", model(
                "1579284",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "https://postfb.ru/",
                "8",
                createSecondaryUrls(
                        "https://postfb.ru/вкусный-коктейль-который-эффективно/",
                        "https://postfb.ru/маска-для-лица-с-морковью-для-естестве/",
                        "https://postfb.ru/вы-можете-заставить-ваши-волосы-восст/",
                        "https://postfb.ru/десять-моментов-которые-каждый-мужчи/",
                        "https://postfb.ru/6-граммов-этой-травы-в-день-может-лечить/",
                        "https://postfb.ru/вы-просыпаетесь-с-болью-в-пятке-настал/",
                        "https://postfb.ru/это-замечательное-средство-вернет-сл/",
                        "https://postfb.ru/6-простых-упражнений-которые-быстро-об/",
                        "https://postfb.ru/боль-в-колене-становится-одной-из-самы/",
                        "https://postfb.ru/как-обнаружить-поддельный-мед-он-везд-2/",
                        "https://postfb.ru/попробуйте-этот-бальзам-и-тонер-для-со/",
                        "https://postfb.ru/этот-удивительный-напиток-топит-жир-к/",
                        "https://postfb.ru/как-снизить-уровень-сахара-в-крови-с-по/",
                        "https://postfb.ru/суп-из-брокколи-и-кале-который-содержи-2/",
                        "https://postfb.ru/диета-с-которой-худеют-все-всего-за-6-дн/",
                        "https://postfb.ru/10-продуктов-которых-следует-избегать/"
                )
        ));

        siteModels.put("1622174", model(
                "1622174",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://fitfb.ru/",
                "8",
                null
        ));

        siteModels.put("1816941", model(
                "1816941",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://lindron.ru/",
                "8",
                null
        ));
        siteModels.put("1750122", model(
                "1750122",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://vintor.ru",
                "8",
                null
        ));
        siteModels.put("1631458", model(
                "1631458",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://postler.ru/",
                "8",
                null
        ));
        siteModels.put("1744991", model(
                "1744991",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://nomey.ru/",
                "8",
                null
        ));
        siteModels.put("1724786", model(
                "1724786",
                45,
                45,
                "1",
                "4",
                null,
                "7017738 - Vedun",
                "http://lenron.ru/",
                "8",
                null
        ));
        siteModels.put("1798782", model(
                "1798782",
                45,
                45,
                "1",
                "3",
                null,
                "11318806 - Marina",
                "http://howmuchprice.info/",
                "3",
                null
        ));
        siteModels.put("1807005", model(
                "1807005",
                45,
                45,
                "1",
                "3",
                null,
                "11318806 - Marina",
                "http://awhhe.am/",
                "3",
                null
        ));

        siteModels.put("1719387", model(
                "1719387",
                40,
                40,
                "0",
                "4",
                null,
                "11026159 - Edoooo",
                "http://gvenik.ru/",
                "6",
                createSecondaryUrls(
                        "http://gvenik.ru/2018/05/11/в-британии-хотят-запретить-влажные-са/",
                        "http://gvenik.ru/2018/05/19/9394/",
                        "http://gvenik.ru/2018/04/27/как-удалить-клеща-подробная-инструкц/",
                        "http://gvenik.ru/2018/04/27/что-может-рассказать-о-женщине-форма-е/",
                        "http://gvenik.ru/2018/04/26/как-проверять-здоровье-самостоятель/",
                        "http://gvenik.ru/2018/05/15/отец-меган-маркл-влип-скандал/",
                        "http://gvenik.ru/2018/05/11/вот-что-рассказал-эксперт-по-языку-тел/",
                        "http://gvenik.ru/2018/05/11/малоизвестные-факты-о-сыне-президент/",
                        "http://gvenik.ru/2018/05/20/9454/",
                        "http://gvenik.ru/2018/05/17/9373/",
                        "http://gvenik.ru/2018/05/17/9363/",
                        "http://gvenik.ru/2018/05/13/вот-5-причин-по-которым-нужно-запретить/",
                        "http://gvenik.ru/2018/05/21/9509/",
                        "http://gvenik.ru/2018/05/19/9431/",
                        "http://gvenik.ru/2018/05/19/9413/",
                        "http://gvenik.ru/2018/05/14/смелые-коты-ниндзя/"
                )
        ));
        siteModels.put("1744475", model(
                "1744475",
                40,
                40,
                "1",
                "4",
                null,
                "11026159 - Edoooo",
                "http://paypey.ru",
                "6",
                createSecondaryUrls(
                        "http://paypey.ru/2018/04/28/расшифровка-моторного-масла/",
                        "http://paypey.ru/2018/03/15/кредит-под-залог-в-москве/",
                        "http://paypey.ru/2018/03/15/услуги-адвоката/",
                        "http://paypey.ru/2018/03/15/как-избежать-раздражения-после-брить/",
                        "http://paypey.ru/2018/05/21/минимализм-заключается-не-в-отсутств/",
                        "http://paypey.ru/2018/05/21/зафиксирована-рекордная-концентраци/",
                        "http://paypey.ru/2018/05/21/женщины-предпочитают-мужественные-л/",
                        "http://paypey.ru/2018/05/12/ксения-собчак-и-максим-виторган-отдых/",
                        "http://paypey.ru/2018/05/11/ford-возьмется-за-водителей-скорых/",
                        "http://paypey.ru/2018/04/12/вы-некрасивые-и-жалкие-лена-миро-объ/",
                        "http://paypey.ru/2018/05/06/вегетарианская-диета-похудей-на-овощ/",
                        "http://paypey.ru/2018/04/26/звезда-сериала-сваты-олег-треповский/",
                        "http://paypey.ru/2018/04/26/неожиданные-совпадения-в-которые-сло/",
                        "http://paypey.ru/2018/05/05/роботов-научили-эффективно-оказыват/",
                        "http://paypey.ru/2018/05/04/через-шесть-лет-на-луну-отправится-рос/",
                        "http://paypey.ru/2018/05/03/альтуризм-туризм-со-смыслом/",
                        "http://paypey.ru/2018/05/01/антон-козлов-ставим-цель-и-идем-вперед/"
                )
        ));

        siteModels.put("1840793", model(
                "1840793",
                40,
                40,
                "1",
                "4",
                null,
                "11359136 - Катя",
                "http://paypey.ru",
                "7",
                createSecondaryUrls(
                        "http://paypey.ru/2018/04/28/расшифровка-моторного-масла/",
                        "http://paypey.ru/2018/03/15/кредит-под-залог-в-москве/",
                        "http://paypey.ru/2018/03/15/услуги-адвоката/",
                        "http://paypey.ru/2018/03/15/как-избежать-раздражения-после-брить/",
                        "http://paypey.ru/2018/05/21/минимализм-заключается-не-в-отсутств/",
                        "http://paypey.ru/2018/05/21/зафиксирована-рекордная-концентраци/",
                        "http://paypey.ru/2018/05/21/женщины-предпочитают-мужественные-л/",
                        "http://paypey.ru/2018/05/12/ксения-собчак-и-максим-виторган-отдых/",
                        "http://paypey.ru/2018/05/11/ford-возьмется-за-водителей-скорых/",
                        "http://paypey.ru/2018/04/12/вы-некрасивые-и-жалкие-лена-миро-объ/",
                        "http://paypey.ru/2018/05/06/вегетарианская-диета-похудей-на-овощ/",
                        "http://paypey.ru/2018/04/26/звезда-сериала-сваты-олег-треповский/",
                        "http://paypey.ru/2018/04/26/неожиданные-совпадения-в-которые-сло/",
                        "http://paypey.ru/2018/05/05/роботов-научили-эффективно-оказыват/",
                        "http://paypey.ru/2018/05/04/через-шесть-лет-на-луну-отправится-рос/",
                        "http://paypey.ru/2018/05/03/альтуризм-туризм-со-смыслом/",
                        "http://paypey.ru/2018/05/01/антон-козлов-ставим-цель-и-идем-вперед/"
                )
        ));

        siteModels.put("1836491", model(
                "1836491",
                40,
                40,
                "1",
                "4",
                null,
                "11026159 - Edoooo",
                "http://paypey.ru",
                "7",
                createSecondaryUrls(

                        "http://paypey.ru/2018/04/28/расшифровка-моторного-масла/",
                        "http://paypey.ru/2018/03/15/кредит-под-залог-в-москве/",
                        "http://paypey.ru/2018/03/15/услуги-адвоката/",
                        "http://paypey.ru/2018/03/15/как-избежать-раздражения-после-брить/",
                        "http://paypey.ru/2018/05/21/минимализм-заключается-не-в-отсутств/",
                        "http://paypey.ru/2018/05/21/зафиксирована-рекордная-концентраци/",
                        "http://paypey.ru/2018/05/21/женщины-предпочитают-мужественные-л/",
                        "http://paypey.ru/2018/05/12/ксения-собчак-и-максим-виторган-отдых/",
                        "http://paypey.ru/2018/05/11/ford-возьмется-за-водителей-скорых/",
                        "http://paypey.ru/2018/04/12/вы-некрасивые-и-жалкие-лена-миро-объ/",
                        "http://paypey.ru/2018/05/06/вегетарианская-диета-похудей-на-овощ/",
                        "http://paypey.ru/2018/04/26/звезда-сериала-сваты-олег-треповский/",
                        "http://paypey.ru/2018/04/26/неожиданные-совпадения-в-которые-сло/",
                        "http://paypey.ru/2018/05/05/роботов-научили-эффективно-оказыват/",
                        "http://paypey.ru/2018/05/04/через-шесть-лет-на-луну-отправится-рос/",
                        "http://paypey.ru/2018/05/03/альтуризм-туризм-со-смыслом/",
                        "http://paypey.ru/2018/05/01/антон-козлов-ставим-цель-и-идем-вперед/"
                )
        ));
        siteModels.put("1727027", model(
                "1727027",
                40,
                40,
                "1",
                "4",
                null,
                "11026159 - Edoooo",
                "http://gvenik.ru",
                "6",
                createSecondaryUrls(
                        "http://gvenik.ru/2018/05/11/в-британии-хотят-запретить-влажные-са/",
                        "http://gvenik.ru/2018/05/19/9394/",
                        "http://gvenik.ru/2018/04/27/как-удалить-клеща-подробная-инструкц/",
                        "http://gvenik.ru/2018/04/27/что-может-рассказать-о-женщине-форма-е/",
                        "http://gvenik.ru/2018/04/26/как-проверять-здоровье-самостоятель/",
                        "http://gvenik.ru/2018/05/15/отец-меган-маркл-влип-скандал/",
                        "http://gvenik.ru/2018/05/11/вот-что-рассказал-эксперт-по-языку-тел/",
                        "http://gvenik.ru/2018/05/11/малоизвестные-факты-о-сыне-президент/",
                        "http://gvenik.ru/2018/05/20/9454/",
                        "http://gvenik.ru/2018/05/17/9373/",
                        "http://gvenik.ru/2018/05/17/9363/",
                        "http://gvenik.ru/2018/05/13/вот-5-причин-по-которым-нужно-запретить/",
                        "http://gvenik.ru/2018/05/21/9509/",
                        "http://gvenik.ru/2018/05/19/9431/",
                        "http://gvenik.ru/2018/05/19/9413/",
                        "http://gvenik.ru/2018/05/14/смелые-коты-ниндзя/"
                )
        ));
        siteModels.put("1836496", model(
                "1836496",
                40,
                40,
                "1",
                "4",
                null,
                "11026159 - Edoooo",
                "http://gvenik.ru",
                "7",
                createSecondaryUrls(
                        "http://gvenik.ru/2018/05/11/в-британии-хотят-запретить-влажные-са/",
                        "http://gvenik.ru/2018/05/19/9394/",
                        "http://gvenik.ru/2018/04/27/как-удалить-клеща-подробная-инструкц/",
                        "http://gvenik.ru/2018/04/27/что-может-рассказать-о-женщине-форма-е/",
                        "http://gvenik.ru/2018/04/26/как-проверять-здоровье-самостоятель/",
                        "http://gvenik.ru/2018/05/15/отец-меган-маркл-влип-скандал/",
                        "http://gvenik.ru/2018/05/11/вот-что-рассказал-эксперт-по-языку-тел/",
                        "http://gvenik.ru/2018/05/11/малоизвестные-факты-о-сыне-президент/",
                        "http://gvenik.ru/2018/05/20/9454/",
                        "http://gvenik.ru/2018/05/17/9373/",
                        "http://gvenik.ru/2018/05/17/9363/",
                        "http://gvenik.ru/2018/05/13/вот-5-причин-по-которым-нужно-запретить/",
                        "http://gvenik.ru/2018/05/21/9509/",
                        "http://gvenik.ru/2018/05/19/9431/",
                        "http://gvenik.ru/2018/05/19/9413/",
                        "http://gvenik.ru/2018/05/14/смелые-коты-ниндзя/"
                )
        ));
        siteModels.put("1735665", model(
                "1735665",
                40,
                40,
                "1",
                "4",
                null,
                "11026159 - Edoooo",
                "http://poxik.ru/",
                "7",
                createSecondaryUrls(

                        "http://poxik.ru/2017/12/11/4-вида-поп-какая-из-них-ваша-выберите-и-у/",
                        "http://poxik.ru/2018/03/24/маргарита-грачева-которую-ее-муж-отру/",
                        "http://poxik.ru/2018/03/25/мы-все-время-обманывались-манту-можно/",
                        "http://poxik.ru/2018/03/26/20-секретов-из-которых-акушерки-молчат/",
                        "http://poxik.ru/2018/04/06/я-потерял-13-кг-и-это-разрушило-мою-жизн/",
                        "http://poxik.ru/2018/04/12/в-таиланде-после-укуса-комара-скончал/",
                        "http://poxik.ru/2018/04/25/первый-выход-кейт-миддлтон-после-родо/",
                        "http://poxik.ru/2018/04/29/щедрый-мистер-президент-сми-узнали-чт/",
                        "http://poxik.ru/2018/05/03/японцы-полируют-шары-из-грязи-до-идеал/",
                        "http://poxik.ru/2018/05/04/страдалицы-несчастные-лена-миро-ра/",
                        "http://poxik.ru/2018/05/10/12-малоизвестных-фактов-о-сыне-президен/",
                        "http://poxik.ru/2018/05/10/анджелина-джоли-всерьез-увлеклась-же/",
                        "http://poxik.ru/2018/05/10/в-сети-который-день-обсуждают-пышное-п/",
                        "http://poxik.ru/2018/05/10/вот-почему-в-британии-хотят-запретить/",
                        "http://poxik.ru/2018/05/10/как-выглядит-мама-первой-леди-сша-ме/",
                        "http://poxik.ru/2018/05/10/модные-конфузы-будущей-жены-принца-га/",
                        "http://poxik.ru/2018/05/12/10-вопиющих-ляпов-в-исторических-фильма/",
                        "http://poxik.ru/2018/05/12/25-мест-где-людям-вообще-не-стоило-бы-жит/",
                        "http://poxik.ru/2018/05/14/10-райских-уголочков-для-влюбленных/",
                        "http://poxik.ru/2018/05/14/25-уникальных-изображений-на-грани-двух/",
                        "http://poxik.ru/2018/05/14/7-тропических-островов-которые-каждый/",
                        "http://poxik.ru/2018/05/14/78-квадратных-метров-красоты-и-функцион/",
                        "http://poxik.ru/2018/05/14/9-интересных-мест-сергиев-посад/",
                        "http://poxik.ru/2018/05/14/самые-прекрасные-улицы-мира/",
                        "http://poxik.ru/2018/05/14/эта-одинокая-башня-находится-прямо-по/",
                        "http://poxik.ru/2018/05/14/эти-20-невероятных-явлений-природы-долж/",
                        "http://poxik.ru/2018/05/14/эти-22-картины-неба-сделанные-в-разных-ч/",
                        "http://poxik.ru/2018/05/14/это-редкое-зрелище-было-снято-на-камер/",
                        "http://poxik.ru/2018/05/14/это-событие-разбудило-весь-мир-16-впеча/",
                        "http://poxik.ru/2018/05/22/19-доказательств-того-что-материнство/",
                        "http://poxik.ru/2018/05/22/7-главных-интриг-свадьбы-принца-гарри-и/"
                )
        ));
        siteModels.put("1717671", model(
                "1717671",
                40,
                40,
                "0",
                "4",
                null,
                "11026159 - Edoooo",
                "http://poxik.ru/",
                "6",
                createSecondaryUrls(

                        "http://poxik.ru/2017/12/11/4-вида-поп-какая-из-них-ваша-выберите-и-у/",
                        "http://poxik.ru/2018/03/24/маргарита-грачева-которую-ее-муж-отру/",
                        "http://poxik.ru/2018/03/25/мы-все-время-обманывались-манту-можно/",
                        "http://poxik.ru/2018/03/26/20-секретов-из-которых-акушерки-молчат/",
                        "http://poxik.ru/2018/04/06/я-потерял-13-кг-и-это-разрушило-мою-жизн/",
                        "http://poxik.ru/2018/04/12/в-таиланде-после-укуса-комара-скончал/",
                        "http://poxik.ru/2018/04/25/первый-выход-кейт-миддлтон-после-родо/",
                        "http://poxik.ru/2018/04/29/щедрый-мистер-президент-сми-узнали-чт/",
                        "http://poxik.ru/2018/05/03/японцы-полируют-шары-из-грязи-до-идеал/",
                        "http://poxik.ru/2018/05/04/страдалицы-несчастные-лена-миро-ра/",
                        "http://poxik.ru/2018/05/10/12-малоизвестных-фактов-о-сыне-президен/",
                        "http://poxik.ru/2018/05/10/анджелина-джоли-всерьез-увлеклась-же/",
                        "http://poxik.ru/2018/05/10/в-сети-который-день-обсуждают-пышное-п/",
                        "http://poxik.ru/2018/05/10/вот-почему-в-британии-хотят-запретить/",
                        "http://poxik.ru/2018/05/10/как-выглядит-мама-первой-леди-сша-ме/",
                        "http://poxik.ru/2018/05/10/модные-конфузы-будущей-жены-принца-га/",
                        "http://poxik.ru/2018/05/12/10-вопиющих-ляпов-в-исторических-фильма/",
                        "http://poxik.ru/2018/05/12/25-мест-где-людям-вообще-не-стоило-бы-жит/",
                        "http://poxik.ru/2018/05/14/10-райских-уголочков-для-влюбленных/",
                        "http://poxik.ru/2018/05/14/25-уникальных-изображений-на-грани-двух/",
                        "http://poxik.ru/2018/05/14/7-тропических-островов-которые-каждый/",
                        "http://poxik.ru/2018/05/14/78-квадратных-метров-красоты-и-функцион/",
                        "http://poxik.ru/2018/05/14/9-интересных-мест-сергиев-посад/",
                        "http://poxik.ru/2018/05/14/самые-прекрасные-улицы-мира/",
                        "http://poxik.ru/2018/05/14/эта-одинокая-башня-находится-прямо-по/",
                        "http://poxik.ru/2018/05/14/эти-20-невероятных-явлений-природы-долж/",
                        "http://poxik.ru/2018/05/14/эти-22-картины-неба-сделанные-в-разных-ч/",
                        "http://poxik.ru/2018/05/14/это-редкое-зрелище-было-снято-на-камер/",
                        "http://poxik.ru/2018/05/14/это-событие-разбудило-весь-мир-16-впеча/",
                        "http://poxik.ru/2018/05/22/19-доказательств-того-что-материнство/",
                        "http://poxik.ru/2018/05/22/7-главных-интриг-свадьбы-принца-гарри-и/"
                )
        ));
        siteModels.put("1717668", model(
                "1717668",
                40,
                40,
                "0",
                "4",
                null,
                "11026159 - Edoooo",
                "http://paypey.ru/",
                "6",
                createSecondaryUrls(

                        "http://paypey.ru/2018/04/28/расшифровка-моторного-масла/",
                        "http://paypey.ru/2018/03/15/кредит-под-залог-в-москве/",
                        "http://paypey.ru/2018/03/15/услуги-адвоката/",
                        "http://paypey.ru/2018/03/15/как-избежать-раздражения-после-брить/",
                        "http://paypey.ru/2018/05/21/минимализм-заключается-не-в-отсутств/",
                        "http://paypey.ru/2018/05/21/зафиксирована-рекордная-концентраци/",
                        "http://paypey.ru/2018/05/21/женщины-предпочитают-мужественные-л/",
                        "http://paypey.ru/2018/05/12/ксения-собчак-и-максим-виторган-отдых/",
                        "http://paypey.ru/2018/05/11/ford-возьмется-за-водителей-скорых/",
                        "http://paypey.ru/2018/04/12/вы-некрасивые-и-жалкие-лена-миро-объ/",
                        "http://paypey.ru/2018/05/06/вегетарианская-диета-похудей-на-овощ/",
                        "http://paypey.ru/2018/04/26/звезда-сериала-сваты-олег-треповский/",
                        "http://paypey.ru/2018/04/26/неожиданные-совпадения-в-которые-сло/",
                        "http://paypey.ru/2018/05/05/роботов-научили-эффективно-оказыват/",
                        "http://paypey.ru/2018/05/04/через-шесть-лет-на-луну-отправится-рос/",
                        "http://paypey.ru/2018/05/03/альтуризм-туризм-со-смыслом/",
                        "http://paypey.ru/2018/05/01/антон-козлов-ставим-цель-и-идем-вперед/"
                )
        ));

        siteModels.put("1660674", model(
                "1660674",
                40,
                40,
                "0",
                "4",
                null,
                "6615828 - Ivan",
                "http://sunsee.info/",
                "8",
                null
        ));
        siteModels.put("1494653", model(
                "1494653",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "https://vidzo.me/",
                "5",
                createSecondaryUrls(
                        "https://vidzo.me/сильным-женщинам-нравится-ходить/",
                        "https://vidzo.me/8-знаков-зодиака-которым-нельзя-давать/",
                        "https://vidzo.me/10-мощных-привычек-счастливых-отношен/",
                        "https://vidzo.me/замена-батареек-прекрасная-груст/",
                        "https://vidzo.me/несравненная-марина-цветаева/",
                        "https://vidzo.me/как-ведут-себя-взрослые-которые-вырос/",
                        "https://vidzo.me/4-знака-зодиака-не-боящиеся-проявлять-и/",
                        "https://vidzo.me/забывчивость-признак-высокого-инте/",
                        "https://vidzo.me/7-главных-ошибок-воспитании-детей/",
                        "https://vidzo.me/дипломатия-искусство-примере/",
                        "https://vidzo.me/одна-булавка-поможет-привлечь-удачу/",
                        "https://vidzo.me/открыть-консервную-банку-голыми-рука/",
                        "https://vidzo.me/как-обстоятельства-меняют-людей/",
                        "https://vidzo.me/идеальный-мужчина-знает-все-сокровен/",
                        "https://vidzo.me/простое-правило-1-секунды-сделает-боле/"
                )
        ));

        siteModels.put("1886789", model(
                "1886789",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "http://naxanna.ru/",
                "5",
                createSecondaryUrls(
                        "http://naxanna.ru/2018/07/23/7-пушистых-фактов-о-красных-пандах/",
                        "http://naxanna.ru/2018/07/23/как-кошачья-мята-работает/",
                        "http://naxanna.ru/2018/07/04/лайведен-нью-билд/",
                        "http://naxanna.ru/2018/07/04/заброшенная-комета-diner/",
                        "http://naxanna.ru/2018/07/04/как-говорить-на-яганском-языке/",
                        "http://naxanna.ru/2018/07/04/как-сделать-морской-шелк/",
                        "http://naxanna.ru/2018/07/03/дворец-клеопатры/",
                        "http://naxanna.ru/2018/07/03/памятник-йонагуни/",
                        "http://naxanna.ru/2018/07/03/умирающее-700-летнее-баньяновое-дерево-б/",
                        "http://naxanna.ru/2018/07/03/исследуйте-звук-островов-которые-ник/",
                        "http://naxanna.ru/2018/07/03/веселые-девы/",
                        "http://naxanna.ru/2018/07/03/10-простых-советов-для-здоровой-жизни/",
                        "http://naxanna.ru/2018/07/01/святая-гора-грэбарка-кресты-всех-форм/",
                        "http://naxanna.ru/2018/07/01/каменные-кошки-на-ракетной-базе-nike/",
                        "http://naxanna.ru/2018/07/01/манчестерская-пчела-будьте-в-поисках/"
                )
        ));

        siteModels.put("1878409", model(
                "1878409",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "https://laruny.ru",
                "5",
                createSecondaryUrls(

                        "https://laruny.ru/2018/06/24/мост-swarkestone/",
                        "https://laruny.ru/2018/06/24/храм-джаганнатха/",
                        "https://laruny.ru/2018/06/24/станция-морга/",
                        "https://laruny.ru/2018/06/24/горький-лимон/",
                        "https://laruny.ru/2018/06/23/книжный-магазин-бертран/",
                        "https://laruny.ru/2018/06/23/обнаружение-самой-высокой-горы-в-солн/",
                        "https://laruny.ru/2018/06/23/местоположение-съемки-mash-вымышленный/",
                        "https://laruny.ru/2018/06/23/подземный-свод-мемориала-линкольна-п/",
                        "https://laruny.ru/2018/06/23/один-квадратный-дюйм-тишины-крошечна/",
                        "https://laruny.ru/2018/06/23/таверна-белой-воды-эта-легенда-литл-ро/",
                        "https://laruny.ru/2018/06/23/bir-zekreet-некоторые-выглядящие-древним-обра/",
                        "https://laruny.ru/2018/06/23/пещера-мерлина/",
                        "https://laruny.ru/2018/06/23/пещера-кобокве/",
                        "https://laruny.ru/2018/06/23/сюрреалистические-экспериментальны/",
                        "https://laruny.ru/2018/06/23/центр-полета-twa-в-аэропорту-jfk/",
                        "https://laruny.ru/2018/06/23/интересные-факты-о-сельскохозяйстве/",
                        "https://laruny.ru/2018/06/23/5-романтических-мест-для-ресторанов-riverbed/",
                        "https://laruny.ru/2018/06/23/сушильный-зеленый-шотландия/",
                        "https://laruny.ru/2018/06/23/здание-lax-theme-лос-анджелес/",
                        "https://laruny.ru/2018/06/23/bodegas-guell/",
                        "https://laruny.ru/2018/06/23/габерун-оазис-ливия/",
                        "https://laruny.ru/2018/06/22/зал-международного-аэропорта-гандер/",
                        "https://laruny.ru/2018/06/22/5-способов-сделать-день-более-длинным/",
                        "https://laruny.ru/2018/06/21/остров-исена/"
                )
        ));

        siteModels.put("1770932", model(
                "1770932",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "https://lyudiraznie24.ru/",
                "5",
                createSecondaryUrls(
                        "https://lyudiraznie24.ru/2018/02/03/парашютист-собрал-кубик-рубика-своб/",
                        "https://lyudiraznie24.ru/2018/02/12/крытый-мост-юнис-уильямс/",
                        "https://lyudiraznie24.ru/2018/02/12/парк-gas-works/",
                        "https://lyudiraznie24.ru/2018/02/23/мышка-отказывается-ложиться-спать-ес/",
                        "https://lyudiraznie24.ru/2018/02/25/красивая-музыка-слушать-одно-удоволь/",
                        "https://lyudiraznie24.ru/2018/03/11/глаз-сахары-самый-загадочный-объект-з/",
                        "https://lyudiraznie24.ru/2018/03/17/о-маленьких-но-постоянно-раздражающи/",
                        "https://lyudiraznie24.ru/2018/03/23/мир-с-высоты-птичьего-полета/",
                        "https://lyudiraznie24.ru/2018/04/08/попугай-говорит-котиком/",
                        "https://lyudiraznie24.ru/2018/04/08/смешной-слоненок-полторы-минуты-пози/",
                        "https://lyudiraznie24.ru/2018/04/08/художник-из-японии-рисует-наши-чувств/",
                        "https://lyudiraznie24.ru/2018/04/15/изучаем-кошачий-язык/",
                        "https://lyudiraznie24.ru/2018/04/15/различные-жизненные-ситуации-милых/",
                        "https://lyudiraznie24.ru/2018/04/15/секвойи-бессмертные-исполинские-ги/"
                )
        ));

        siteModels.put("1689851", model(
                "1689851",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "https://mosvmeste.ru/",
                "5",
                createSecondaryUrls("https://mosvmeste.ru/2018/01/17/7-фраз-которые-никогда-не-произносят-ус/",
                        "https://mosvmeste.ru/2018/02/06/10-лучших-советов-ошо/",
                        "https://mosvmeste.ru/2018/02/16/один-день-из-жизни-профессионального/",
                        "https://mosvmeste.ru/2018/02/16/отпустишь-прошлое-получишь-будущее/",
                        "https://mosvmeste.ru/2018/02/21/9-способов-выразить-свою-любовь-сло/",
                        "https://mosvmeste.ru/2018/02/25/почему-решать-чужие-проблемы-категор/",
                        "https://mosvmeste.ru/2018/02/26/миллион-алых-роз-прекрасном-испол/",
                        "https://mosvmeste.ru/2018/02/26/фильмы-книги-которые-меняют-жизнь/",
                        "https://mosvmeste.ru/2018/03/04/8-вещей-которые-зрелые-мужчины-никогда/",
                        "https://mosvmeste.ru/2018/03/04/вершина-эгоизма-сологамия-брак/",
                        "https://mosvmeste.ru/2018/03/04/жена-и-удача/",
                        "https://mosvmeste.ru/2018/03/14/10-снов-которые-не-стоит-игнорировать/",
                        "https://mosvmeste.ru/2018/03/14/15-лучших-цитат-омара-хайяма/",
                        "https://mosvmeste.ru/2018/03/19/5-типов-мужчин-которых-никогда/",
                        "https://mosvmeste.ru/2018/03/25/знаки-зодиака-которые-идеально-подхо/",
                        "https://mosvmeste.ru/2018/03/26/10-способов-справиться-с-тревогой/",
                        "https://mosvmeste.ru/2018/04/03/лгут-знаки-зодиака-своим-вторым/",
                        "https://mosvmeste.ru/2018/04/11/10-способов-справиться-со-стрессом/",
                        "https://mosvmeste.ru/2018/04/15/10-мощных-привычек-счастливых-отношен/",
                        "https://mosvmeste.ru/2018/04/24/почему-такая-красивая-одна/"
                        )
        ));

        siteModels.put("1495353", model(
                "1495353",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "https://yerireq.ru/",
                "5",
                createSecondaryUrls(
                        "https://yerireq.ru/2-правила-которые-изменят-вашу-личную-ж/",
                        "https://yerireq.ru/судьба-этой-шпионки-второй-мировой-во/",
                        "https://yerireq.ru/правда-или-ложь/",
                        "https://yerireq.ru/8-фото-мгновение-трагедии-кото/",
                        "https://yerireq.ru/вот-что-происходит-с-вашим-организмом/",
                        "https://yerireq.ru/10-повседневных-вещей-которые-мы-все-эт/",
                        "https://yerireq.ru/юная-акробатка-американском-шоу-та/",
                        "https://yerireq.ru/9-хитростей-которыми-ваши-гаджеты/",
                        "https://yerireq.ru/10-продуктов-которые-не-стоит-хранить/",
                        "https://yerireq.ru/сладкий-ребенок-хочется-слушать-вечн/",
                        "https://yerireq.ru/5-самых-омерзительных-работ/",
                        "https://yerireq.ru/чего-вы-боитесь-больше-всего/"
                )
        ));

        siteModels.put("1694441", model(
                "1694441",
                45,
                45,
                "0",
                "4",
                null,
                "6615828 - Ivan",
                "https://snamiveselo24.ru/",
                "8",
                null
        ));
        siteModels.put("1694438", model(
                "1694438",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "https://snamiveselo24.ru/",
                "5",
                createSecondaryUrls(

                        "https://snamiveselo24.ru/2017/11/24/солнечную-систему-впервые-прилетел/",
                        "https://snamiveselo24.ru/2017/11/26/вывод-который-можно-сделать-по-походк/",
                        "https://snamiveselo24.ru/2017/11/27/китай-открыл-самую-крутую-библиотеку/",
                        "https://snamiveselo24.ru/2017/11/28/жизнь-1-100-лет-120-секунд/",
                        "https://snamiveselo24.ru/2017/12/10/малыш-вышел-сцену-покорить-се/",
                        "https://snamiveselo24.ru/2018/01/27/малоизвестная-молитва-от-антуана-де-с/",
                        "https://snamiveselo24.ru/2018/02/16/20-цитат-совести-запада-альбера-кам/",
                        "https://snamiveselo24.ru/2018/02/21/вам_вcтpeчались-солнечные-люди/",
                        "https://snamiveselo24.ru/2018/02/26/apple-год-извлекла-тонну-золота-списа/",
                        "https://snamiveselo24.ru/2018/03/04/законная-владелица-солнца-испанка/",
                        "https://snamiveselo24.ru/2018/03/04/пронзительные-рассказы-из-шести-слов/",
                        "https://snamiveselo24.ru/2018/03/14/какую-опасность-скрывают-воды-черног/",
                        "https://snamiveselo24.ru/2018/03/14/путь-электромобиля-tesla-к-марсу-можно-про/",
                        "https://snamiveselo24.ru/2018/03/19/самая-маленькая-дикая-кошка-мире/",
                        "https://snamiveselo24.ru/2018/03/25/гениальный-мультфильм-том-работ/",
                        "https://snamiveselo24.ru/2018/03/26/что-случится-землей-если-солнце-вдру/",
                        "https://snamiveselo24.ru/2018/04/03/детеныш-носорога-преследует-автомоб/",
                        "https://snamiveselo24.ru/2018/04/11/еакция-белухи-двух-малышей-наобор/",
                        "https://snamiveselo24.ru/2018/04/15/позитив-маленьких-африканских-тан/",
                        "https://snamiveselo24.ru/2018/04/24/я-научилась-просто-мудро-жить/"
                )
        ));
        siteModels.put("1483835", model(
                "1483835",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "http://sunsee.info/",
                "5",
                createSecondaryUrls(
                        "https://sunsee.info/ролик-всего-то-на-12-секунд-а-смеха/",
                        "https://sunsee.info/эта-записка-дверях-акушера-гинекол/",
                        "https://sunsee.info/10-фото-о-том-как-женщины-отомстили-мужу/",
                        "https://sunsee.info/все-мужчины-влюбляются-только-ту-жен/",
                        "https://sunsee.info/вот-сколько-вы-должны-весить-в-соответ/",
                        "https://sunsee.info/6-верных-признаков-того-что-вы-состоите/",
                        "https://sunsee.info/6-признаков-того-что-вы-счастливая-н/",
                        "https://sunsee.info/5-причин-почему-мужчины-уходят-лю/",
                        "https://sunsee.info/9-комиксов-том-живут-нормальные-л/",
                        "https://sunsee.info/10-звезд-до-того-как-у-них-появились-стил/",
                        "https://sunsee.info/13-мужчин-которым-можно-дать-медаль/",
                        "https://sunsee.info/вы-со-второй-половинкой-одного-з/",
                        "https://sunsee.info/3-ингредиента-которые-вернут-жизнь-люб/",
                        "https://sunsee.info/оптическая-иллюзия-которая-поможет/",
                        "https://sunsee.info/10-хитростей-всегда-выглядеть-обв/",
                        "https://sunsee.info/5-приемов-которые-помогут-вам/",
                        "https://sunsee.info/5-поз-которые-помогут-справиться-со-стр/",
                        "https://sunsee.info/настроения-любви-двух-словах/",
                        "https://sunsee.info/9-романтических-жестов-которыми-вы-мож/",
                        "https://sunsee.info/2-правила-серьезно-заинтересова/",
                        "https://sunsee.info/7-правил-этикета-которые-мы-должны-знат/",
                        "https://sunsee.info/никто-не-говорил-мне-что-эти-6-вещей-мог/",
                        "https://sunsee.info/нежность-это-не-слабость-нежность/",
                        "https://sunsee.info/20-вещей-которые-стоит-сделать-30-лет-что/"
                )
        ));

        siteModels.put("1770941", model(
                "1770941",
                45,
                45,
                "1",
                "3",
                null,
                "6615828 - Ivan",
                "http://mirchudes24.ru/",
                "5",
                createSecondaryUrls(
                        "http://mirchudes24.ru/2018/02/18/почему-люди-карими-глазами-самые-луч/",
                        "http://mirchudes24.ru/2018/02/19/цените-женщин-что-вас-дома-ждут/",
                        "http://mirchudes24.ru/2018/02/23/научиться-замечать-подсказки-жиз/",
                        "http://mirchudes24.ru/2018/03/04/простая-философия-не-навреди-но-и-не-т/",
                        "http://mirchudes24.ru/2018/03/25/3-совета-как-научится-читать-чужие-мысл/",
                        "http://mirchudes24.ru/2018/04/01/главная-проблема-женатых-людей/",
                        "http://mirchudes24.ru/2018/04/01/люди-которые-говорят-сами-с-собой-ге/",
                        "http://mirchudes24.ru/2018/04/01/о-личности-и-индивидуальности/",
                        "http://mirchudes24.ru/2018/04/08/7-причин-почему-пара-должна-путешество/",
                        "http://mirchudes24.ru/2018/04/08/тест-на-определение-вашего-биологиче/",
                        "http://mirchudes24.ru/2018/04/08/фильмы-которые-не-отпускают-до-самого/",
                        "http://mirchudes24.ru/2018/04/15/в-солнечную-систему-впервые-прилетел/",
                        "http://mirchudes24.ru/2018/04/15/никогда-нельзя-хрустеть-пальцами/",
                        "http://mirchudes24.ru/2018/04/15/уходите-от-токсичных-людей-включая-то/"
                )
        ));

        siteModels.put("1660669", model(
                "1660669",
                40,
                40,
                "0",
                "4",
                null,
                "6615828 - Ivan",
                "https://vidzo.me/",
                "8",
                null
        ));
        siteModels.put("1548087", model(
                "1548087",
                40,
                40,
                "0",
                "4",
                null,
                "10199054 - Semir",
                "http://neoguru.ru/",
                "6",
                null
        ));

        siteModels.put("1795220", model(
                "1795220",
                40,
                40,
                "1",
                "4",
                null,
                "10199054 - Semir",
                "http://egaio.ru/",
                "8",
                createSecondaryUrls(
                        "https://egaio.ru/2018/06/17/эти-травы-могут-помочь-вам-справиться/",
                        "https://egaio.ru/2018/06/18/это-убийца-ожирения-только-одна-столо/",
                        "https://egaio.ru/2018/07/21/вот-почему-вы-должны-пить-имбирный-чай/",
                        "https://egaio.ru/2018/05/03/нанесите-немного-этого-масла-на-шею-и-в/",
                        "https://egaio.ru/2018/08/08/оливковое-масло-хорошо-для-моих-волос/",
                        "https://egaio.ru/2018/06/26/эти-продукты-помогут-вам-состариться/",
                        "https://egaio.ru/2018/07/15/только-с-3-столовыми-ложками-в-день-вы-п/",
                        "https://egaio.ru/2018/04/13/7-аптечных-средств-которые-работают-лу/",
                        "https://egaio.ru/2018/06/25/это-самый-здоровый-завтрак-очиститес/",
                        "https://egaio.ru/2018/04/14/магическая-сила-женской-мысли/",
                        "https://egaio.ru/2018/07/23/невероятный-жиросжигающий-напиток-д-2/",
                        "https://egaio.ru/2018/08/04/пожалуйста-сделайте-паузу-на-2-минуты-и/",
                        "https://egaio.ru/2018/02/27/в-италии-женщинам-теперь-дают-выходны/",
                        "https://egaio.ru/2018/02/27/женщина-купила-кольцо-за-13-долларов-но/",
                        "https://egaio.ru/2018/02/27/10-фильмов-с-сюжетом-скрученные-так-кла/"
                )
        ));

        siteModels.put("1754686", model(
                "1754686",
                40,
                40,
                "1",
                "4",
                null,
                "10199054 - Semir",
                "https://nirlen.ru/",
                "8",
                createSecondaryUrls(
                        "https://nirlen.ru/жители-северных-стран-считаются-самы/",
                        "https://nirlen.ru/9-неожиданных-фактов-о-том-как-связаны/",
                        "https://nirlen.ru/мышьяк-нитраты-и-фториды-врачи-предуп/",
                        "https://nirlen.ru/9-антивозрастных-упражнений-для-лица-ч/",
                        "https://nirlen.ru/11-комиксов-о-детях-и-родителях-которые/",
                        "https://nirlen.ru/модели-плюс-сайз-рассказали-какие-вещ/",
                        "https://nirlen.ru/топ-4-мифов-о-раке-в-которые-давно-пора-п/",
                        "https://nirlen.ru/сплетники-злорадствуют-варнава-дов/",
                        "https://nirlen.ru/в-индонезии-разгневанная-толпа-убила-300/",
                        "https://nirlen.ru/ужасающий-эксперимент-с-бигмаком-пос/",
                        "https://nirlen.ru/новая-самая-красивая-девочка-в-мире-пя/",
                        "https://nirlen.ru/бархатная-кожа-без-тонального-и-пудры/",
                        "https://nirlen.ru/как-избавиться-от-жировика-естествен/",
                        "https://nirlen.ru/7-вещей-которые-мы-напрасно-считали-фра/",
                        "https://nirlen.ru/7-сигналов-которые-неосознанно-посыла/",
                        "https://nirlen.ru/как-общаться-с-подростками-чтобы-не-ст/",
                        "https://nirlen.ru/быстрый-психологический-портрет-жен/"
                )
        ));

//        siteModels.put("1754686", model(
//                "1754686",
//                40,
//                40,
//                "1",
//                "4",
//                null,
//                "10199054 - Semir",
//                "https://nirlen.ru/",
//                "8",
//                null
//        ));
        siteModels.put("1795234", model(
                "1795234",
                40,
                40,
                "1",
                "4",
                null,
                "10199054 - Semir",
                "http://jenskijurnal.ru",
                "8",
                null
        ));
        siteModels.put("1754687", model(
                "1754687",
                40,
                40,
                "0",
                "4",
                null,
                "10199054 - Semir",
                "https://nirlen.ru/",
                "6",
                null
        ));

        siteModels.put("1786596", model(
                "1786596",
                40,
                40,
                "1",
                "4",
                null,
                "10199054 - Semir",
                "http://lexde.ru/",
                "8",
                null
        ));

        siteModels.put("1533654", model(
                "1533654",
                40,
                40,
                "1",
                "4",
                null,
                "10199054 - Semir",
                "http://neoguru.ru/",
                "8",
                null
        ));

        siteModels.put("1678296", model(
                "1678296",
                40,
                40,
                "1",
                "4",
                null,
                "7195882 - Дмитрий",
                "http://palata09.ru/",
                "8",
                null
        ));

        siteModels.put("1802877", model(
                "1802877",
                40,
                40,
                "1",
                "4",
                null,
                "7195882 - Дмитрий",
                "http://palata09.ru/",
                "8",
                null
        ));

        siteModels.put("1681664", model(
                "1681664",
                45,
                45,
                "0",
                "4",
                null,
                "7195882 - Дмитрий",
                "http://palata09.ru/",
                "8",
                null
        ));

        siteModels.put("1893913", model(
                "1893913",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://handygrow.ru/",
                "5",
                null
        ));


        siteModels.put("1794908", model(
                "1794908",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://pozitivonst.ru/",
                "5",
                null
        ));

        siteModels.put("1857532", model(
                "1857532",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://mentalclub.ru/",
                "5",
                null
        ));

        siteModels.put("1877104", model(
                "1877104",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://babybuby.ru/",
                "5",
                null
        ));

        siteModels.put("1872651", model(
                "1872651",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://mojjo.ru/",
                "5",
                null
        ));
        siteModels.put("1853657", model(
                "1853657",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://mojjo.ru/",
                "5",
                null
        ));

        siteModels.put("1821896", model(
                "1821896",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://helthy.ru/",
                "5",
                null
        ));

        siteModels.put("92378", model(
                "92378",
                45,
                45,
                "1",
                "5",
                null,
                "1189508 - celmondd",
                "http://lyashenkox.ru/",
                "7",
                createSecondaryUrls(
                        "http://lyashenkox.ru/utes.html",
                        "http://lyashenkox.ru/utes01.html",
                        "http://lyashenkox.ru/utes02.html",
                        "http://lyashenkox.ru/utes03.html",
                        "http://lyashenkox.ru/utes04.html",
                        "http://lyashenkox.ru/utes05.html",
                        "http://lyashenkox.ru/utes06.html",
                        "http://lyashenkox.ru/utes07.html",
                        "http://lyashenkox.ru/utes08.html",
                        "http://lyashenkox.ru/utes09.html",
                        "http://lyashenkox.ru/utes10.html",
                        "http://lyashenkox.ru/utes11.html",
                        "http://lyashenkox.ru/usbm.html",
                        "http://lyashenkox.ru/usbm01.html",
                        "http://lyashenkox.ru/usbm03.html"
                )
        ));

        siteModels.put("1829911", model(
                "1829911",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "https://narza.ru",
                "5",
                createSecondaryUrls(

                        "https://narza.ru/2018/04/30/не-верите-что-козероги-лучшие-прочтит/",
                        "https://narza.ru/2018/04/30/почему-нельзя-выносить-мусор-вечером-7/",
                        "https://narza.ru/2018/04/30/теперь-я-засыпаю-за-1-минуту-вот-магиче/",
                        "https://narza.ru/2018/04/30/молитва-за-близких-и-родных-читать-каж/",
                        "https://narza.ru/2018/04/30/не-думай-о-плохом-заболеешь-стоит-пр/",
                        "https://narza.ru/2018/04/29/сироп-из-одуванчиков-это-средство-пре/",
                        "https://narza.ru/2018/04/29/это-самое-мощное-масло-улучши-работу-м/",
                        "https://narza.ru/2018/04/24/что-ни-в-коем-случае-нельзя-запрещать-д/",
                        "https://narza.ru/2018/04/29/делайте-эту-маску-1-раз-в-неделю-и-ваша-к/",
                        "https://narza.ru/2018/04/29/если-у-вас-тонкие-волосы/",
                        "https://narza.ru/2018/04/27/отбеливающая-маска-для-лица-и-шеи-чтоб/",
                        "https://narza.ru/2018/04/06/поклонники-разочарованы-выбором-сам/",
                        "https://narza.ru/2018/03/15/следуйте-этой-диете-чтобы-получить-су/",
                        "https://narza.ru/2018/03/15/изучите-лучшие-естественные-методы-у/"
                )
        ));

        siteModels.put("1822785", model(
                "1822785",
                45,
                45,
                "1",
                "4",
                null,
                "11235471 - Olga Bulkina",
                "http://bulto.ru/",
                "5",
                createSecondaryUrls(

                        "https://bulto.ru/хотите-чтобы-ваше-лицо-выглядело-на-10-л/",
                        "https://bulto.ru/9-продуктов-помогающих-избавиться-от-з/",
                        "https://bulto.ru/хозяйственное-мыло-для-красоты-гигие/",
                        "https://bulto.ru/как-заваривать-имбирь-для-похудения-п/",
                        "https://bulto.ru/диетический-суп-из-индейки-с-зеленым-г/",
                        "https://bulto.ru/попробуй-этот-огуречный-сок-растворя/",
                        "https://bulto.ru/диета-при-молочнице-правила-питания-с/",
                        "https://bulto.ru/как-освежить-свою-внешность-за-30-дней-10-с/",
                        "https://bulto.ru/7-дней-7-стаканов-мощный-метод-который/",
                        "https://bulto.ru/срочная-диета-минус-5-кг-за-6-дней/",
                        "https://bulto.ru/низкокалорийный-яблочный-пирог-на-ке/",
                        "https://bulto.ru/диета-с-йогуртом-и-корицей/",
                        "https://bulto.ru/творожный-зефир-для-тех-кто-худеет/"
                )
        ));

        siteModels.put("1755586", model(
                "1755586",
                45,
                45,
                "1",
                "3",
                null,
                "11110031 - Artsrun",
                "http://www.qmedy.com",
                "6",
                null
        ));

        siteModels.put("1755586", model(
                "1755586",
                45,
                45,
                "1",
                "3",
                null,
                "11110031 - Artsrun",
                "http://www.qmedy.com/",
                "6",
                null
        ));

        siteModels.put("1804232", model(
                "1804232",
                45,
                45,
                "1",
                "3",
                null,
                "11110031 - Artsrun",
                "http://holyeconomy.com",
                "6",
                null
        ));

        siteModels.put("1864301", model(
                "1864301",
                45,
                45,
                "1",
                "3",
                null,
                "11449638 - nastia88",
                "https://nahodki.top/",
                "4",
                createSecondaryUrls(
                        "https://nahodki.top/2018/08/18/nochnoi-kop-yama-s-otlichnymi-nahodkami/",
                        "https://nahodki.top/2018/08/17/nedavnie-nahodki-oruzhiya-foto/",
                        "https://nahodki.top/2018/08/17/znaki-na-dereve-ukazyvali-mesto-klada/",
                        "https://nahodki.top/2018/08/16/7-samyh-bolshih-sokrovishch/",
                        "https://nahodki.top/2018/08/11/kolco-ot-alyuminievoj-banki-sokrovishche/",
                        "https://nahodki.top/2018/08/09/nashli-armejskuyu-kassu-polnuyu-deneg/",
                        "https://nahodki.top/2018/08/01/rimskij-persten-cena-i-podrobnosti/",
                        "https://nahodki.top/2018/07/30/zolotoj-rimskij-persten-2018/",
                        "https://nahodki.top/2018/07/28/oruzhie-iz-zemli-nahodki/",
                        "https://nahodki.top/2018/07/28/shtyk-nozhi-najdennye-s-metalloiskatelem/",
                        "https://nahodki.top/2018/07/24/transport-kladoiskatelej/",
                        "https://nahodki.top/2018/07/20/boevoj-pistolet-prodali-kak-igrushku/",
                        "https://nahodki.top/2018/07/19/3000-letnij-bronzovyj-mech-najden-v-danii/",
                        "https://nahodki.top/2018/07/11/5-kopeek-1956-goda-sssr-cena-monety/"
                )
        ));

        siteModels.put("1826120", model(
                "1826120",
                45,
                45,
                "1",
                "3",
                null,
                "11218187 - Goodkat",
                "http://poctroyka.ru/",
                "5",
                createSecondaryUrls(
                        "http://poctroyka.ru/krysha/59-myagkaya-krovlya-svoimi-rukami",
                        "http://poctroyka.ru/otdelochnye-raboty/58-finishnaya-otdelka-sten",
                        "http://poctroyka.ru/otdelochnye-raboty/57-uteplenie-doma-snaruzhi-svoimi-rukami",
                        "http://poctroyka.ru/peregorodki-i-proemy/56-montazh-okon-svoimi-rukami",
                        "http://poctroyka.ru/krysha/55-montazh-krovli-iz-profnastila",
                        "http://poctroyka.ru/perekrytiya-lestnitsy/54-kak-sdelat-perekrytie-doma",
                        "http://poctroyka.ru/inzhenernye-seti/53-gazifikatsiya-chastnogo-doma-pod-klyuch",
                        "http://poctroyka.ru/proektirovanie/52-sdacha-v-ekspluatatsiyu-zhilogo-doma",
                        "http://poctroyka.ru/otdelochnye-raboty/51-fasadnye-stroitelnye-raboty",
                        "http://poctroyka.ru/otdelochnye-raboty/50-vnutrennyaya-otdelka-chastnogo-doma",
                        "http://poctroyka.ru/inzhenernye-seti/49-ustrojstvo-gazosnabzheniya",
                        "http://poctroyka.ru/inzhenernye-seti/48-kanalizatsiya-dlya-chastnogo-doma-kak-pravilno",
                        "http://poctroyka.ru/inzhenernye-seti/47-vodoprovod-v-chastnom-dome-svoimi-rukami",
                        "http://poctroyka.ru/inzhenernye-seti/46-konditsionirovanie-doma",
                        "http://poctroyka.ru/inzhenernye-seti/45-sistema-ventilyatsii-v-chastnom-dome"
                )
        ));

        siteModels.put("1849399", model(
                "1849399",
                45,
                45,
                "1",
                "3",
                null,
                "11436585 - Александр",
                "http://citynews-ru.ru/",
                "5",
                createSecondaryUrls(
                        "http://citynews-ru.ru/chislo-bitkoin-bankomatov/",
                        "http://citynews-ru.ru/portfel-kazhdogo-investora/",
                        "http://citynews-ru.ru/plyusy-i-minusy-bankovskix-depozitov/",
                        "http://citynews-ru.ru/centralnyj-bank-gonkonga/",
                        "http://citynews-ru.ru/kriptovalyutnaya-birzha-binance/",
                        "http://citynews-ru.ru/glava-mastercard-kriptovalyuty-eto-musor/",
                        "http://citynews-ru.ru/chto-takoe-foreks/",
                        "http://citynews-ru.ru/chto-takoe-binarnye-opciony/",
                        "http://citynews-ru.ru/bankovskie-kredity-dlya-chego-nuzhny/",
                        "http://citynews-ru.ru/finansy-kriptovalyuty/"
                )
        ));

        siteModels.put("1478391", model(
                "1478391",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://hodizdorov.ru/site-map",
                "6",
                null
        ));

        siteModels.put("1479122", model(
                "1479122",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://hodizdorov.ru/site-map",
                "6",
                null
        ));



        siteModels.put("1416347", model(
                "1416347",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://hodizdorov.ru/site-map",
                "6",
                null
        ));

        siteModels.put("1417724", model(
                "1417724",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://hodizdorov.ru/site-map",
                "6",
                null
        ));

        siteModels.put("1851876", model(
                "1851876",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://hodizdorov.ru/site-map",
                "6",
                null
        ));

        siteModels.put("1482297", model(
                "1482297",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://fit-fox.ru",
                "6",
                null
        ));

        siteModels.put("1479122", model(
                "1479122",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://ablamirat.ru/",
                "6",
                null
        ));

        siteModels.put("1479172", model(
                "1479172",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://tempremonta.ru/karta-sajta",
                "6",
                null
        ));
        siteModels.put("1417712", model(
                "1417712",
                55,
                55,
                "1",
                "5",
                null,
                "9553676 - Дмитрий",
                "http://house-lab.ru/karta-sajta",
                "6",
                null
        ));

        siteModels.put("1761603", model(
                "1761603",
                45,
                45,
                "1",
                "3",
                null,
                "11194517 - Gor",
                "http://big-zemlya.ru/",
                "5",
                null
        ));

        siteModels.put("1812457", model(
                "1812457",
                45,
                45,
                "1",
                "3",
                null,
                "11346060 - Davo",
                "http://treydor.ru",
                "6",
                null
        ));

        siteModels.put("1671515", model(
                "1671515",
                45,
                45,
                "1",
                "4",
                null,
                "10778279 - Arto",
                "http://ketax.ru",
                "6",
                null
        ));

        siteModels.put("1693453", model(
                "1693453",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://doppy.ru/",
                "5",
                createSecondaryUrls(

                        "http://doppy.ru/2018/01/13/озеро-титикака/",
                        "http://doppy.ru/2018/01/13/национальный-парк-флиндерс-чейз-авст/",
                        "http://doppy.ru/2018/01/31/удивительное-озеро-гамильтон-пул-сша/",
                        "http://doppy.ru/2018/01/04/рисовые-террасы-хунхэ-хани-в-китае/",
                        "http://doppy.ru/2018/03/21/сирийский-хомяк/",
                        "http://doppy.ru/2018/05/04/дворец-во-франции-построенный-почтал/",
                        "http://doppy.ru/2018/03/21/йоркширский-терьер/",
                        "http://doppy.ru/2018/03/15/колибри/",
                        "http://doppy.ru/2018/01/10/бирюзовая-река-соча-словения-италия/",
                        "http://doppy.ru/2018/05/07/снежный-фестиваль-в-саппоро-япония/",
                        "http://doppy.ru/2018/05/11/искусство-ковроткачества-в-марокко/",
                        "http://doppy.ru/2018/04/12/полярэкс/",
                        "http://doppy.ru/2018/04/18/золотой-мост-понте-веккьо-во-флоренци/",
                        "http://doppy.ru/2018/02/13/парк-цветов-кёкенкоф-нидерланды/",
                        "http://doppy.ru/2018/02/08/каньон-антилопы-в-сша/",
                        "http://doppy.ru/2017/11/08/вулкан-везувий-vesuvio/",
                        "http://doppy.ru/2018/01/13/гора-килиманджаро-в-танзании-африка/"
                )
        ));

        siteModels.put("1641670", model(
                "1641670",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://bronxik.ru/",
                "5",
                createSecondaryUrls(
                        "http://bronxik.ru/2018/05/13/пустыня-гоби-gobi-2/",
                        "http://bronxik.ru/2018/05/07/остров-лангкави-langkawi-2/",
                        "http://bronxik.ru/2018/04/28/поклонная-гора-парк-победы/",
                        "http://bronxik.ru/2018/04/25/канарские-острова-2/",
                        "http://bronxik.ru/2018/04/18/тауэрский-мост-tower-bridge/",
                        "http://bronxik.ru/2018/04/15/майами-бич-miami-beach-2/",
                        "http://bronxik.ru/2018/04/11/мертвое-море-dead-sea-2/",
                        "http://bronxik.ru/2018/04/06/город-прага-prague/",
                        "http://bronxik.ru/2018/03/31/желтое-море-yellow-sea/",
                        "http://bronxik.ru/2018/03/27/музей-ван-гога-van-gogh-museum/",
                        "http://bronxik.ru/2018/03/25/остров-эльба/",
                        "http://bronxik.ru/2018/03/16/музей-боба-марли-bob-marley-museum/",
                        "http://bronxik.ru/2018/03/13/город-торонто-toronto/",
                        "http://bronxik.ru/2018/03/11/гоа-goa/",
                        "http://bronxik.ru/2018/03/05/кольцо-гора/",
                        "http://bronxik.ru/2018/03/02/майами-бич-miami-beach/",
                        "http://bronxik.ru/2018/02/27/мачу-пикчу/"
                )
        ));

        siteModels.put("1832924", model(
                "1832924",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://hepii.ru",
                "5",
                createSecondaryUrls(
                        "https://hepii.ru/?p=326",
                        "https://hepii.ru/?p=316",
                        "https://hepii.ru/?p=308",
                        "https://hepii.ru/?p=301",
                        "https://hepii.ru/?p=295",
                        "https://hepii.ru/?p=287",
                        "https://hepii.ru/?p=282",
                        "https://hepii.ru/?p=277",
                        "https://hepii.ru/?p=272",
                        "https://hepii.ru/?p=267",
                        "https://hepii.ru/?p=262",
                        "https://hepii.ru/?p=257",
                        "https://hepii.ru/?p=252",
                        "https://hepii.ru/?p=247"
                )
        ));

        siteModels.put("1870648", model(
                "1870648",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://icanbbee.ru/",
                "5",
                createSecondaryUrls(
                        "http://icanbbee.ru/2018/07/15/институт-биологии-южных-морей-украин/",
                        "http://icanbbee.ru/2018/07/15/музей-истории-автомобилей-в-моделях-у/",
                        "http://icanbbee.ru/2018/07/15/музей-морских-катастроф-украина-мало/",
                        "http://icanbbee.ru/2018/07/15/литературный-музей-украина-одесса-оп/",
                        "http://icanbbee.ru/2018/07/14/художественный-музей-имени-ярошенко/",
                        "http://icanbbee.ru/2018/07/14/крепость-музей-украина-судак/",
                        "http://icanbbee.ru/2018/07/14/музей-заповедник-усадьба-попова-ук/",
                        "http://icanbbee.ru/2018/07/14/музеи-италии/",
                        "http://icanbbee.ru/2018/07/13/экскурсия-к-звездам3-знаменитых-обсер/",
                        "http://icanbbee.ru/2018/07/13/парадный-вход-8-монументальных-ворот/",
                        "http://icanbbee.ru/2018/07/11/центр-искусств-королевы-софии-испани/",
                        "http://icanbbee.ru/2018/07/11/музей-прадо-описание-как-найти-в-мадри/",
                        "http://icanbbee.ru/2018/07/11/каирский-национальный-музей-египет/",
                        "http://icanbbee.ru/2018/07/11/музей-bmw-в-мюнхене-и-музей-мерседес-в-шту/",
                        "http://icanbbee.ru/2018/07/09/музей-порше-porsche-в-штутгарте-адрес-музея/",
                        "http://icanbbee.ru/2018/07/09/дрезденская-картинная-галерея-время/",
                        "http://icanbbee.ru/2018/07/06/галерея-уффици-во-флоренции-адрес-и-оп/",
                        "http://icanbbee.ru/2018/07/06/галерея-спада-рим-расположение-на-кар/",
                        "http://icanbbee.ru/2018/07/06/рейксмузеум-в-амстердаме/",
                        "http://icanbbee.ru/2018/07/06/национальная-галерея-лондон-англия/",
                        "http://icanbbee.ru/2018/07/06/музей-мадам-тюссо-в-лондоне/"
                )
        ));

        siteModels.put("1836385", model(
                "1836385",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://doocy.ru",
                "5",
                createSecondaryUrls(

                        "http://doocy.ru/2018/05/28/парфенон-в-афинах-parthenon/",
                        "http://doocy.ru/2018/05/25/шунантунич-xunantunich/",
                        "http://doocy.ru/2018/05/13/дюна-эфа/",
                        "http://doocy.ru/2018/05/07/остров-белла-остров-изола-белла/",
                        "http://doocy.ru/2018/04/30/музей-современного-искусства-в-нитер/",
                        "http://doocy.ru/2018/04/30/мэрия-лондона-london-city-hall/",
                        "http://doocy.ru/2018/04/30/опера-осло-operahuset/",
                        "http://doocy.ru/2018/04/30/башня-агбар-torre-agbar/",
                        "http://doocy.ru/2018/04/30/музей-гуггенхайма-в-бильбао-guggenheim-museum-bilbao/",
                        "http://doocy.ru/2018/04/30/центр-гейдара-алиева/",
                        "http://doocy.ru/2018/04/30/хранилище-судного-дня-всемирное-семе/",
                        "http://doocy.ru/2018/04/30/храм-лотоса-lotus-temple/",
                        "http://doocy.ru/2018/04/30/атомиум-atomium/",
                        "http://doocy.ru/2018/04/25/пещера-рук-куэва-де-лас-манос/",
                        "http://doocy.ru/2018/04/25/пещера-шондонг-son-doong/",
                        "http://doocy.ru/2018/04/25/моравский-крас-moravsky-kras/",
                        "http://doocy.ru/2018/04/25/великоанадольский-лес/",
                        "http://doocy.ru/2018/04/25/танцующий-лес-на-куршской-косе/",
                        "http://doocy.ru/2018/04/25/бассейн-амазонки-amazon-basin/",
                        "http://doocy.ru/2018/04/25/шварцвальд-schwarzwald-черный-лес/",
                        "http://doocy.ru/2018/04/25/беловежская-пуща-belovezhskaya-pushcha-national-park/"
                )
        ));

        siteModels.put("1866924", model(
                "1866924",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://fueggo.ru",
                "5",
                createSecondaryUrls(

                        "http://fueggo.ru/2018/06/25/древний-город-эфес-efes/",
                        "http://fueggo.ru/2018/06/21/город-лиссабон-lisboa/",
                        "http://fueggo.ru/2018/06/14/санур-sanur/",
                        "http://fueggo.ru/2018/06/08/аквариум-анталии-antalya-aquarium/",
                        "http://fueggo.ru/2018/06/08/диснейленд-в-токио-tokyo-disneyland/",
                        "http://fueggo.ru/2018/06/08/музей-скансен-skansen/",
                        "http://fueggo.ru/2018/06/08/деревня-санта-клауса-деревня-йоулупу/",
                        "http://fueggo.ru/2018/06/08/парк-миниатюр-мини-европа/",
                        "http://fueggo.ru/2018/06/08/парк-развлечений-порт-авентура-port-aventura/",
                        "http://fueggo.ru/2018/06/08/национальная-галерея-шотландии-national-gallery-of-scotland/",
                        "http://fueggo.ru/2018/06/08/эрмитаж-в-амстердаме-hermitage-amsterdam/",
                        "http://fueggo.ru/2018/06/08/город-стратфорд-на-эйвоне/",
                        "http://fueggo.ru/2018/06/08/город-солсбери/",
                        "http://fueggo.ru/2018/06/08/галерея-академии-в-венеции/",
                        "http://fueggo.ru/2018/06/08/центр-фотографии-им-братьев-люмьер/",
                        "http://fueggo.ru/2018/06/08/город-кардифф/",
                        "http://fueggo.ru/2018/06/08/рейксмузеум-rijksmuseum/",
                        "http://fueggo.ru/2018/06/08/уаи-о-тапу-вайотапу/",
                        "http://fueggo.ru/2018/06/08/дорога-смерти-юнгас-north-yungas-road/",
                        "http://fueggo.ru/2018/06/08/трансфэгэрашское-шоссе-дорога-7с/",
                        "http://fueggo.ru/2018/06/08/великая-океанская-дорога-great-ocean-road/",
                        "http://fueggo.ru/2018/06/08/город-абердин/",
                        "http://fueggo.ru/2018/06/08/аппиева-дорога-via-appia/",
                        "http://fueggo.ru/2018/06/08/город-бристоль/"
                )
        ));

        siteModels.put("1742970", model(
                "1742970",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://sliipy.ru",
                "5",
                createSecondaryUrls(
                        "https://sliipy.ru/2018/05/28/дворец-дожей-palazzo-ducale/",
                        "https://sliipy.ru/2018/05/25/чичен-ица-chichen-itza/",
                        "https://sliipy.ru/2018/05/13/пустыня-намиб-namіb/",
                        "https://sliipy.ru/2018/05/07/острова-кондао-con-dao/",
                        "https://sliipy.ru/2018/04/28/олимпийский-парк-сочи/",
                        "https://sliipy.ru/2018/04/18/мост-миллениум-в-казани/",
                        "https://sliipy.ru/2018/04/15/кута-kuta/",
                        "https://sliipy.ru/2018/04/11/статуя-свободы/",
                        "https://sliipy.ru/2018/04/06/город-токио-tokyo/",
                        "https://sliipy.ru/2018/03/27/галерея-тейт-модерн-tate-modern/",
                        "https://sliipy.ru/2018/03/25/остров-сокотра-socotra/",
                        "https://sliipy.ru/2018/03/19/остров-мэн-isle-of-man/",
                        "https://sliipy.ru/2018/03/16/монастыри-метеоры-meteora/",
                        "https://sliipy.ru/2018/03/13/город-эдинбург-edinburgh/",
                        "https://sliipy.ru/2018/03/11/амальфитанское-побережье-costiera-amalfitana/",
                        "https://sliipy.ru/2018/03/05/утесы-мохер-cliffs-of-moher/",
                        "https://sliipy.ru/2018/03/02/розовый-пляж-pink-sands-beach/",
                        "https://sliipy.ru/2018/02/27/долина-смерти-death-valley/",
                        "https://sliipy.ru/2018/02/24/бостон/",
                        "https://sliipy.ru/2018/02/24/дублин/",
                        "https://sliipy.ru/2018/02/14/древний-город-эфес-efes/",
                        "https://sliipy.ru/2018/02/13/река-чаупхрая-chao-phraya/",
                        "https://sliipy.ru/2018/02/11/ниагарский-водопад-niagara-falls/",
                        "https://sliipy.ru/2018/02/09/остров-кюсю-kyushu-island/"
                )
        ));

        siteModels.put("1737312", model(
                "1737312",
                45,
                45,
                "1",
                "3",
                null,
                "10624362 - Bronx",
                "http://sniizy.ru",
                "5",
                createSecondaryUrls(
                        "http://sniizy.ru/2018/05/28/гейрангер-фьорд/",
                        "http://sniizy.ru/2018/05/25/холм-большого-будды/",
                        "http://sniizy.ru/2018/05/13/пустыня-атакама-desierto-de-atacama/",
                        "http://sniizy.ru/2018/05/07/остров-рюген-rugen/",
                        "http://sniizy.ru/2018/04/28/дворцово-парковый-ансамбль-царицыно/",
                        "http://sniizy.ru/2018/04/25/нормандия-normandie/",
                        "http://sniizy.ru/2018/04/22/город-ла-пас-la-paz/",
                        "http://sniizy.ru/2018/04/18/эресуннский-мост-oresund-bridge/",
                        "http://sniizy.ru/2018/04/15/копаоник-kopaonik/",
                        "http://sniizy.ru/2018/04/11/рейхстаг-reichstag-building/",
                        "http://sniizy.ru/2018/04/06/город-ванкувер-vancouver/",
                        "http://sniizy.ru/2018/03/27/эрмитаж-в-амстердаме-hermitage-amsterdam/",
                        "http://sniizy.ru/2018/03/25/принцевы-острова/",
                        "http://sniizy.ru/2018/03/19/остров-бора-бора-bora-bora/",
                        "http://sniizy.ru/2018/03/16/монастырь-острог-ostrog/",
                        "http://sniizy.ru/2018/03/13/город-шанхай-shanghai/",
                        "http://sniizy.ru/2018/03/11/джемете/",
                        "http://sniizy.ru/2018/03/05/арболь-де-пьедра-arbol-de-piedra/",
                        "http://sniizy.ru/2018/03/02/кута-kuta/",
                        "http://sniizy.ru/2018/02/27/ниагарский-водопад/",
                        "http://sniizy.ru/2018/02/24/лос-анджелес/",
                        "http://sniizy.ru/2018/02/24/оттава/"
                )
        ));

        siteModels.put("1844270", model(
                "1844270",
                45,
                45,
                "1",
                "5",
                null,
                "10701692 - Вова",
                "http://legalayz.ru",
                "8",
                createSecondaryUrls(
                        "http://legalayz.ru/2017/08/12/тест-сможете-ли-вы-угадать-анимационн/",
                        "http://legalayz.ru/2017/09/01/выберите-окно-и-оно-откроет-правду-о-то/",
                        "http://legalayz.ru/2017/10/07/этот-тест-определит-уровень-вашей-гра/",
                        "http://legalayz.ru/2017/10/29/тест-для-интровертов-тип-личности-по-м/",
                        "http://legalayz.ru/2017/11/13/выберите-картинку-и-узнайте-ваше-псих/",
                        "http://legalayz.ru/2018/02/22/sekrety-narodnoj-kitajskoj-mediciny-dlja-bystroj-borby-s-ustalostju/",
                        "http://legalayz.ru/2018/03/04/10-zhivotnyh-kotoryh-sozdal-djavol/",
                        "http://legalayz.ru/2018/03/09/13-letnij-malchishka-nes-na-rukah-bolnuju-sestru-po-pylajushhemu-koridoru-a-potom-bosikom-po-snegu-v-40-on-spas-vsju-semju/",
                        "http://legalayz.ru/2018/03/25/hozjajka-chut-ne-umerla-ot-serdechnogo-pristupa-uvidev-svoih-7-loshadej-lezhashhih-na-zemle/",
                        "http://legalayz.ru/2018/04/05/shjeron-stoun-foto-bez-makijazha-sejchas/",
                        "http://legalayz.ru/2018/04/05/znamenitosti-kotorye-sovershili-ubijstvo/",
                        "http://legalayz.ru/2018/04/14/v-pakistane-beremennuju-pevicu-zastrelili-prjamo-na-scene-za-otkaz-vystupat-stoja/",
                        "http://legalayz.ru/2018/04/20/jetot-4-letnij-rebenok-vneshne-pohozh-na-starichka-vrachi-do-sih-por-ne-mogut-objasnit-prichinu-jetogo/",
                        "http://legalayz.ru/2018/04/20/u-vas-doma-est-kupjury-1-dollara-proverte-vozmozhno-oni-stojat-tysjachi/",
                        "http://legalayz.ru/2018/04/24/ubitaja-gorem-sobaka-broshennaja-iz-za-ejo-nekrasivogo-lica-nashla-dom-i-silno-izmenilas/",
                        "http://legalayz.ru/2018/04/30/igil-ustroil-ohotu-na-prnoaktrisu-snjavshujusja-v-hidzhabe/",
                        "http://legalayz.ru/2018/04/30/pjat-stran-gde-mozhno-kupit-zhenu/",
                        "http://legalayz.ru/2018/05/02/v-kakom-mesjace-devushka-rodilas-takoj-u-nee-i-harakter-popadanie-100/",
                        "http://legalayz.ru/2018/05/03/esli-vy-najdete-zhenshhinu-na-jetom-foto-vash-iq-vyshe-srednego/",
                        "http://legalayz.ru/2018/05/10/sosedi-napisali-zapisku-strastnoj-parochke/",
                        "http://legalayz.ru/2018/05/14/jetoj-devushke-prorochat-pobedu-na-evrovidenii-a-ee-klip-nabral-bolee-25-mln-prosmotrov/",
                        "http://legalayz.ru/2018/05/14/sharliz-teron-nabrala-23-kilogramma-dlja-novoj-roli-i-ee-bolshe-ne-uznajut-fanaty/",
                        "http://legalayz.ru/2018/05/18/ocherednoj-tanec-anastasii-volochkovoj-napugal-poklonnikov/",
                        "http://legalayz.ru/2018/05/22/pjat-sovetov-o-kotoryh-dolzhen-znat-kazhdyj-muzhchina/",
                        "http://legalayz.ru/2018/05/22/vas-ne-budut-uvazhat-kak-zhenshhinu-esli-vy-delaete-jeti-9-veshhej/",
                        "http://legalayz.ru/2018/05/28/jeto-ad-hudshij-koshmar-ljuboj-materi-devushka-vpala-v-komu-iz-za-oslozhnenij-ot-obychnoj-prostudy-ona-dvazhdy-umerla-na-operacionnom-stole/"
                )
        ));

        siteModels.put("1830532", model(
                "1830532",
                45,
                45,
                "1",
                "5",
                null,
                "10701692 - Вова",
                "http://hmblog.ru",
                "8",
                createSecondaryUrls(
                )
        ));

        siteModels.put("1862254", model(
                "1862254",
                45,
                45,
                "1",
                "6",
                null,
                "11359136 - Катя",
                "http://kraxi.ru",
                "7",
                createSecondaryUrls(
                )
        ));

        siteModels.put("1871076", model(
                "1871076",
                45,
                45,
                "1",
                "6",
                null,
                "11359136 - Катя",
                "http://www.dayick.com",
                "8",
                createSecondaryUrls(
                )
        ));

        siteModels.put("1845359", model(
                "1845359",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://sparepartssale.ru",
                "5",
                createSecondaryUrls(
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-axor-i-i-ii-pokoleniya-posobie-po-remontu-i-ekspluatatsii-elektroshemy.html",
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-axor-posobie-po-ekspluatatsii-i-tehnicheskomu-obslujivaniyu-tom-1.html",
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-axor-mersedes-aksor-s-2005-kniga-po-remontu-i-ekspluatatsii--katalog-zapchastey.html",
                        "http://sparepartssale.ru/avtoliteratura/volvo-fh--fm-s-2002-instruktsiya-po-ekspluatatsii-i-tehobslujivaniyu.html",
                        "http://sparepartssale.ru/avtoliteratura/volvo-fh-c-2005-posobie-po-remontu.html",
                        "http://sparepartssale.ru/avtoliteratura/volvo-fh12-1993-1998-posobie-po-remontu-i-ekspluatatsii--katalog-detaley.html",
                        "http://sparepartssale.ru/avtoliteratura/volvo-fm-s-2002-instruktsiya-po-remontu-i-ekspluatatsii.html",
                        "http://sparepartssale.ru/avtoliteratura/volvo-fh-s-2002-kniga-po-remontu-i-ekspluatatsii.html",
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-actros-new-s-03-11-rukovodstvo-po-remontu.html",
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-actros-1996-2007-kniga-po-remontu-i-ekspluatatsii.html",
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-actros-1996-2003-dizel-kniga-po-remontu-i-ekspluatatsii.html",
                        "http://sparepartssale.ru/avtoliteratura-20265/mercedes-benz-actros-2-2003-2008--actros-3-2008-2011-dizel-posobie-po-remontu-i-ekspluatatsii.html"
                )
        ));

        siteModels.put("1901529", model(
                "1901529",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://imptecho.ru/",
                "5",
                createSecondaryUrls(
                        "http://imptecho.ru/samovary/elektrosamovar-kelli-kl-1324.html",
                        "http://imptecho.ru/samovary/elektrosamovar-elis-el-4022.html",
                        "http://imptecho.ru/samovary/elektrosamovar-elis-el-4052.html",
                        "http://imptecho.ru/samovary/elektrosamovar-chudesnitsa-es-3503.html",
                        "http://imptecho.ru/samovary/elektrosamovar-rosinka-ros-1006.html",
                        "http://imptecho.ru/samovary/elektrosamovar-jarkoff-jk-1001.html",
                        "http://imptecho.ru/samovary/elektrosamovar-centek-ct-0092a.html",
                        "http://imptecho.ru/samovary/elektrosamovar-dobrynya-do-418-chernyy-hohloma.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofe-kami-l-espresso-oro-1kg-v-zernah.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofe-segafredo-intermezzo-500gr.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofe-carraro-don-carlos-1kg-v-zernah.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofe-amado-brazilskiy-santos-arabika-05kg-.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofe-smart-coffee-club-roma-10sht-kofe-v-kapsulah.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofemolka-nivona-nicg-130.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofemolka-delonghi-kg79.html",
                        "http://imptecho.ru/kofevarki-kofemashiny-kofemolki-kofe/kofemolka-gorenje-smk-150-w.html"
                )
        ));

        siteModels.put("1865800", model(
                "1865800",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://countrytech.ru/",
                "5",
                createSecondaryUrls(
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-sony-gtk-xb60.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-jbl-xtreme.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-jbl-pulse-3.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-harman-kardon-onyx-studio-4.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-bbk-bta7000.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-jbl-flip-4.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-jbl-horizon.html",
                        "http://countrytech.ru/portativnaya-akustika/portativnaya-akustika-philips-bt6000w12.html",
                        "http://countrytech.ru/domashniy-kinoteatr/domashniy-kinoteatr-sony-bdv-n9200ww.html",
                        "http://countrytech.ru/domashniy-kinoteatr/domashniy-kinoteatr-sony-bdv-e4100.html",
                        "http://countrytech.ru/domashniy-kinoteatr/domashniy-kinoteatr-sony-ht-ct80.html",
                        "http://countrytech.ru/domashniy-kinoteatr/domashniy-kinoteatr-philips-htl-1190b12.html",
                        "http://countrytech.ru/portativnye-dvd-pleery/portativnyy-dvd-pleer-hyundai-h-lcd1000.html",
                        "http://countrytech.ru/portativnye-dvd-pleery/portativnyy-dvd-pleer-hyundai-h-lcd900.html",
                        "http://countrytech.ru/portativnye-dvd-pleery/portativnyy-dvd-pleer-hyundai-h-lcd700.html",
                        "http://countrytech.ru/portativnye-dvd-pleery/portativnyy-dvd-pleer-mystery-mps-105.html"
                )
        ));

        siteModels.put("1846631", model(
                "1846631",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://bigprodzap.ru",
                "5",
                createSecondaryUrls(
                        "http://bigprodzap.ru/lampy/r5w-t16-12v-5w--ba15s-lampa-upakovka-10-sht-blick.html",
                        "http://bigprodzap.ru/predohraniteli/mini-10-mm-30-a--predohranitel-upakovka-10-sht-blick-zelnyiy.html",
                        "http://bigprodzap.ru/predohraniteli/mini-10-mm-25-a--predohranitel-upakovka-10-sht-blick-prozrachn.html",
                        "http://bigprodzap.ru/predohraniteli/mini-10-mm-20-a--predohranitel-upakovka-10-sht-blick-jelt.html",
                        "http://bigprodzap.ru/predohraniteli/mini-10-mm-15-a--predohranitel-upakovka-10-sht-blick-siniy.html",
                        "http://bigprodzap.ru/lampy/p15w-12v-15w--ba15s-lampa-upakovka-10-sht-selum.html",
                        "http://bigprodzap.ru/lampy/py21w-s25-12v-21w--ba15s-lampa-upakovka-10-sht-blick-jelt.html",
                        "http://bigprodzap.ru/lampy/p215w-12v-215w--ba15d-lampa-upakovka-10-sht-selum.html",
                        "http://bigprodzap.ru/lampy/p214w-12v-214w--baz15d-lampa-upakovka-10-sht-selum.html",
                        "http://bigprodzap.ru/lampy/t4w-12v-4w--ba9s-lampa-upakovka-10-sht-selum.html",
                        "http://bigprodzap.ru/lampy/w5w-t10-12v-5w--w21x95d-lampa-upakovka-10-sht-blick.html",
                        "http://bigprodzap.ru/lampy/w3w-t10-12v-3w--w21x95d-lampa-upakovka-10-sht-blick.html"
                )
        ));

        siteModels.put("1848724", model(
                "1848724",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://avtoelektron.ru",
                "5",
                createSecondaryUrls(
                        "http://avtoelektron.ru/avtoseyfy/seyf-dometic-safe-md361c.html",
                        "http://avtoelektron.ru/avtoseyfy/seyf-dometic-safe-md-281c.html",
                        "http://avtoelektron.ru/avtoseyfy/seyf-dometic-safe-361c.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-indel-b-arctic-plus---1800-watts.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-webasto-compact-cooler-4e-24-v.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-dometic-freshjet-3200.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-dometic-freshlight-2200.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-webasto-compact-cooler-8-1224-v.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-coleman-mach-3-plus-395-kvt.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-waeco-coolair-rt-880.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-truma-aventa-comfort.html",
                        "http://avtoelektron.ru/avtokonditsionery/avtokonditsioner-truma-saphir-compact.html"
                )
        ));

        siteModels.put("1849509", model(
                "1849509",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://toysforallshop.ru/",
                "5",
                createSecondaryUrls(
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-gidrosamolet-art-tech-a5-seaplane-epo-24g---21421.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-samolet-art-tech-cessna-182-400-class-s-lyjami-24g---2101t.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-samolet-art-tech-wing-dragon-4---24g---22032.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-samolet-lodka-art-tech-coota-24g---21104.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-samolet-art-tech-wing-dragon-sportster---24g---22022.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/model-samolta-dynam-sbach-342-24g-mode-2-kod-dy8945.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/model-samolta-dynam-su-26m-rtf-24g-kod-dy8948.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/model-samolta-dynam-pitts-model-12-rtf-koddy8947.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/bumajnyy-samoletik-s-motorom-paper-plane-338-kod-pu338.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-kater-double-horse-flying-fish-7006-kod-7006.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-kater-feilun-ft010-racing-boat-24g---ft010.html",
                        "http://toysforallshop.ru/sudomodeli--samolty/radioupravlyaemyy-kater-s-beskollektornym-motorom-wltoys-24g---wl915.html"
                )
        ));

        siteModels.put("1852919", model(
                "1852919",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://impetech.ru/",
                "5",
                createSecondaryUrls(
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-zigmund-shtain-vge-3998-x.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-zigmund-shtain-vgg-3862-x.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-kaiser-hge-61501-r.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-simfer-f96gw52001.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-ricci-rgc-9040bz.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-kaiser-hgg-62501-w.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-electrolux-ekk-96458-cx.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-simfer-f96eo52001.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-bosch-hgd-745255-r.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-ardesia-d667-rcrs.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-beko-csm-62321-da.html",
                        "http://impetech.ru/gazovye-plity/gazovaya-plita-electrolux-ekg-96118-cx.html"
                )
        ));

        siteModels.put("1861276", model(
                "1861276",
                45,
                45,
                "1",
                "4",
                null,
                "11469965 - Евгений",
                "http://vwnaobzore.ru/",
                "5",
                createSecondaryUrls(
                        "http://vwnaobzore.ru/75000",
                        "http://vwnaobzore.ru/74999",
                        "http://vwnaobzore.ru/74998",
                        "http://vwnaobzore.ru/74997",
                        "http://vwnaobzore.ru/74996",
                        "http://vwnaobzore.ru/74991",
                        "http://vwnaobzore.ru/75009",
                        "http://vwnaobzore.ru/75023",
                        "http://vwnaobzore.ru/75028"
                )
        ));

        siteModels.put("1844132", model(
                "1844132",
                45,
                45,
                "1",
                "4",
                null,
                "11299914 - Tony",
                "http://roama.ru",
                "6",
                createSecondaryUrls()
        ));

        siteModels.put("1804232", model(
                "1804232",
                45,
                45,
                "1",
                "3",
                null,
                "11110031 - Artsrun",
                "http://holyeconomy.com/",
                "6",
                createSecondaryUrls()
        ));

        siteModels.put("1865939", model(
                "1865939",
                45,
                45,
                "1",
                "3",
                null,
                "11392968 - Никита",
                "https://www.rebuttaloflies.com/",
                "5",
                createSecondaryUrls(
                        "https://www.rebuttaloflies.com/signs",
                        "https://www.rebuttaloflies.com/amitivill",
                        "https://www.rebuttaloflies.com/annabel",
                        "https://www.rebuttaloflies.com/reik",
                        "https://www.rebuttaloflies.com/chupakabra"
                )
        ));

        siteModels.put("1873231", model(
                "1873231",
                45,
                45,
                "1",
                "3",
                null,
                "9919386 - Sargis",
                "http://qoogs.ru/",
                "6",
                createSecondaryUrls(
                        "http://qoogs.ru/2018/06/06/кровь-от-ушей-бузова-убила-пением-бе/",
                        "http://qoogs.ru/2018/06/06/рада-объявил-об-условии-по-умолчанию-в/",
                        "http://qoogs.ru/2018/06/06/макрон-сравнил-переговоры-с-трампом-с/",
                        "http://qoogs.ru/2018/06/06/путин-перед-поездкой-в-китай-подготов/",
                        "http://qoogs.ru/2018/06/06/путин-признал-что-мог-работать-адвока/",
                        "http://qoogs.ru/2018/06/02/как-выбрать-кроссовки-типы-подобной-о/",
                        "http://qoogs.ru/2018/06/02/бывший-главный-редактор-форбса-акрэй/",
                        "http://qoogs.ru/2018/06/02/коалиция-во-главе-с-сша-сделала-новый-у/",
                        "http://qoogs.ru/2018/06/02/в-ростовской-области-пять-человек-уме/",
                        "http://qoogs.ru/2018/06/02/камбербэтчу-удалось-спасти-курьера-о/",
                        "http://qoogs.ru/2018/05/31/там-там-и-здесь/",
                        "http://qoogs.ru/2018/05/31/высокая-цена/",
                        "http://qoogs.ru/2018/05/31/зависть-tankina/",
                        "http://qoogs.ru/2018/05/31/японцы-хитрость-но-мы-больше-хитрост/",
                        "http://qoogs.ru/2018/05/31/задница-одноклассника/",
                        "http://qoogs.ru/2018/05/29/кошки-на-кровати/"
                )
        ));

        siteModels.put("1841011", model(
                "1841011",
                45,
                45,
                "1",
                "3",
                null,
                "11144191 - Андрей",
                "http://rubachok.ru",
                "6",
                createSecondaryUrls(
                        "http://rubachok.ru/pletnaya-leska-berkley-/pletnaya-leska-berkley-fireline-tracer-braid-110m-016.html",
                        "http://rubachok.ru/pletenaya-leska-allvega/pletenaya-leska-allvega-yellow-92m-012.html",
                        "http://rubachok.ru/pletenaya-leska-allvega/pletenaya-leska-allvega-yellow-92m-028.html",
                        "http://rubachok.ru/pletenaya-leska-allvega/pletenaya-leska-allvega-yellow-92m-030.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-light-game-130m-04.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-light-game-130m-03.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-light-game-130m-02.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-mid-game-150m-15.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-mid-game-150m-12.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-mid-game-150m-1.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-mid-game-150m-08.html",
                        "http://rubachok.ru/pletnaya-leska-aiko/pletnaya-leska-aiko-unitex-mid-game-150m-06.html"
                )
        ));

        siteModels.put("1841019", model(
                "1841019",
                45,
                45,
                "1",
                "3",
                null,
                "11144191 - Андрей",
                "http://doctornot.ru/",
                "6",
                createSecondaryUrls(
                        "http://doctornot.ru/bloki-pitaniya-lenovo/blok-pitaniya-40y7700-200v-45a-79x55x05-dlya-lenovo.html",
                        "http://doctornot.ru/bloki-pitaniya-lenovo/blok-pitaniya-pa-1900-56lc-200v-45a-55x25-dlya-lenovo.html",
                        "http://doctornot.ru/bloki-pitaniya-lenovo/blok-pitaniya-200v-45a-pryamougolnyy-dlya-lenovo.html",
                        "http://doctornot.ru/moduli-pamyati/modul-pamyati-8gb-ddr4-2400mgts-so-dimm-ramaxel-rmsa3230kb78haf-2133.html",
                        "http://doctornot.ru/moduli-pamyati/modul-pamyati-8gb-ddr4-2400mgts-so-dimm-hynix-hma81gs6afr8n-uhn0.html",
                        "http://doctornot.ru/moduli-pamyati/modul-pamyati-2gb-ddr3-1600mgts-so-dimm-hynix-hmt325s6efr8a-pb.html",
                        "http://doctornot.ru/moduli-pamyati/modul-pamyati-16gb-ddr4-2400mgts-so-dimm-hynix-hma82gs6mfr8n.html",
                        "http://doctornot.ru/jestkie-diski/jestkiy-disk-25-95mm-western-digital-1tb-sata-iii-wd10jpvx-08.html",
                        "http://doctornot.ru/jestkie-diski/jestkiy-disk-25-7mm-seagate-500gb-sata-iii-st500lt012.html",
                        "http://doctornot.ru/jestkie-diski/jestkiy-disk-25-7mm-seagate-1tb-sata-iii-st1000lm035.html",
                        "http://doctornot.ru/jestkie-diski/jestkiy-disk-25-7mm-hgst-500gb-sata-iii-hts725050a7e630.html",
                        "http://doctornot.ru/jestkie-diski/jestkiy-disk-25-5mm-seagate-500gb-sata-iii-st500lt032.html"
                )
        ));

//        http://vector-remonta.ru/karta-sajta
//        http://vash-center.ru/karta
//        http://nauka-mastera.ru/karta
//        http://ya-vdome.ru/karta-sajta
//        http://ideya-doma.ru/karta
//        http://tempremonta.ru/karta-sajta
//        http://freshremont.com/sitemap
//        http://faza-remonta.ru/karta-sajta
//        http://house-lab.ru/karta-sajta
//        http://v-procese.ru/karta-sajta
//        http://gidpostroyki.ru/sitemap
//        http://shtorylab.ru/karta
//        http://zona-postroyki.ru/karta-sajta
//        http://fit-fox.ru/
//        http://motorfly.ru/

//        https://tomocenter.com.ua/

//   № 1898189: «Время деньги»
//  № 1898192: «Добыча рублей»
//        9553676 - Дмитрий

        return siteModels;
    }

    private static SiteModel model(String taskId,
                                   Integer advertiseFreeze,
                                   Integer siteFreeze,
                                   String countAdvertise,
                                   String countAdvertiseMove,
                                   String strategy,
                                   String taskOwner,
                                   String mainUrl,
                                   String countSecondaryUrls,
                                   ArrayList<String> secondaryUrls
                                   ) {
        SiteModel model = new SiteModel();
        model.setTaskId(taskId);
        model.setCountSecondaryUrls(countSecondaryUrls);
        model.setAdvertiseFreeze(advertiseFreeze);
        model.setSiteFreeze(siteFreeze);
        model.setCountAdvertise(countAdvertise);
        model.setCountAdvertiseMove(countAdvertiseMove);
        model.setStrategy(strategy != null ? strategy : "classic");
        model.setTaskOwner(taskOwner);
        model.setMainUrl(mainUrl);
        model.setSecondaryUrls(secondaryUrls);
        return model;
    }

    private static ArrayList<String> createSecondaryUrls(String... elements) {
        ArrayList<String> list = new ArrayList<>();
        list.addAll(Arrays.asList(elements));
        return list;
    }
}

//        10813496 - Genadi
//        11206263 - Дмитрий
//        11016161 - Stepan
//        9950949 - Artyom
//        10603708 - Areg
//        7017738 - Vedun
//        11318806 - Marina
//        11026159 - Edoooo
//        6615828 - Ivan
//        10199054 - Semir
//        7195882 - Дмитрий
//        11235471 - Olga Bulkina
//        11346060 - Davo
//        10624362 - Bronx
